/*
    Да се креира структура Tanc во која се чуваат податоци за името на танцот и земја на потекло (низи од 15 знаци) .

    Потоа да се креирa структура Tancer во која се чуваат:

    - податоци за име и презиме (низи од максимум 20 знаци),
    - низа од 5 танци (структура Tanc) кои дадениот танчер може да ги игра.

    Дополнително, за оваа структура да се обезбеди функција со потпис :

    - void tancuvanje(Tancer *t, int n, char *zemja) што ќе ги испечати во посебен ред името и презимето на танчерите
    што знаат да играат барем по еден танц од земјата која е проследена како аргумент на функцијата,
    како и името на танцот во формат: Име Презиме, Име на танц
*/
