// Да се креира класа Воз во која се чуваат податоци за релацијата по која се движи возот (низа од најмногу 50 знаци), предвиден бројот на километри што треба да се поминат (реален број), како и бројот на патници во возот (цел број).
//
// Потоа да се креирa класа ZeleznickaStanica во која се чуваат податоци за градот во кој се наоѓа (низа од 20 знаци), низа од возови што поаѓаат од станицата (најмногу 30) и бројот на возови (цел број).
//
// Треба да се напише функција
//
// void najkratkaRelacija(ZeleznickaStanica* zs, int n, char* grad)
//
// во која се печати релацијата и бројот на километри на возот што поминува најкратка релација (најмалку километри), а поаѓа од железничката станица од градот што се проследува како влезен аргумент. Ако има повеќе возови со ист најмал број на километри, да се испечати релацијата на последниот таков.
//
// Забелешка: Задачата да се реши во програмскиот јазик C++
//
// For example:
// Input 	Result
//
// 1
// Dresden
// 2
// Dresden-Berlin 192 200
// Dresden-Lajpcig 115 90
// Dresden
//
//
//
// Najkratka relacija: Dresden-Lajpcig (115 km)

#include<iostream>
using namespace std;


int main() {
	return 0;
}
