/*
    Во програмскиот јазик C++ да се креира структура Vozenje за опишување на адреналински возења во забавен парк.
    Структурата треба да содржи: (5 поени)

    - Име на возењето ( низа од 100 знаци)
    - Времетраење во минути (цел број)
    - Цена (децимален број)
    - Дали има студентски попуст (1-да, 0-не)

    Да се креира структура ZabavenPark, што содржи: (10 поени)

    - Име на забавниот парк (низа од 100 знаци)
    - Локација (низа од 100 знаци)
    - Низа од адреналински возења во паркот (низа од максимум 100 елементи од структурата Vozenje)
    - Број на елементи во низата (цел број)

    Да се креира функција print за печатење на информациите за сите возења во забавниот парк во формат: (10 поени)
        [Ime na parkot] [Lokacija]
        [Ime1] [Vremetraenje1] [Cena1]
        [Ime2] [Vremetraenje2] [Cena2]
        [Ime3] [Vremetraenje3] [Cena3]
        ...
    Да се креира функција najdobar_park, што прима низа од променливи од типот ZabavenPark и го печати името и локацијата
    на паркот кој е најефтин за посета од страна на студенти. Најефтин парк е оној што содржи најголем број возења со студентски попуст.
    Ако повеќе паркови ги делат овие карактеристики, да се испечати паркот со најголемото времетраење од сите возења.* (20 поени)*

    Да се дополни функцијата main (5 поени).
*/
