/*
    Да се напише класа Chocolate која ги содржи следните податоци за еден чоколаден производ:

    - name - име на чоколадото, низа од најмногу 100 знаци;
    - price - стандардна малопродажна цена на еден пакет од чоколадите

    За класата да се напишат default конструктор и конструктор со параметри.
    Да се преоптовари операторот << за да ги печати објектите од класата во следниот формат: [name]: $[price].

    Потоа да се дефинира класата ChocolateFactory, која ги содржи следните податоци за фабрика за чоколадо:

    - products - динамички алоцирана низа од Chocolate објекти
    - weeklyProduction - динамички алоцирана низа од цели броеви, така што weeklyProduction[i] означува колку пакети од products[i] фабриката произведува неделно
    - numProducts - број на типови чоколади кои фабриката ги нуди.

    За класата да се дефинираат конструктор со параметри, деструктор, како и следните методи:

    - weeklyIncome() која ја пресметува вкупната вредност на чоколадите кои фабриката ги произведува неделно
    - оператори < и > за споредба на две фабрики според неделната заработка
    - оператор + кој како резултат дава нова фабрика со комбинираното производство на двете фабрики
    - оператор << за печатење на објектот во следниот формат:
    
    [product0] x [weeklyProduction0]
    [product1] x [weeklyProduction2]
    ...
    [productN] x [weeklyProductionN]
    $[weeklyIncome]/wk

    Да не се менува main функцијата. Се признаваат и решенија без динамичка алокација на меморија.
*/