/*
    Задача 2 (60 поени)

    Да се дефинира класа Account која претставува банкарска сметка на еден корисник.

    За класата Account се чуваат:

        - Име на корисникот (текстуална низа од 30 знаци)
        - Идентификациски број (цел број)
        - Тип на корисник (енумерациски тип, физичко или правно лице)
        - салдо (децимален број)

    Идентификацискиот број е единствен за секој корисник, неговата почетна вредност е 111110.
    Да се обезбеди секвенцијално генерирање на овој број, така што првата сметка ќе има идентификациски број 111111, втората 111112, третата 111113 итн. (5 поени)

    За оваа класа да се обезбедат потребните конструктори, set и get методи. (5 поени)

    Да се имплементира оператор за печатење << со кој ќе се печатат информациите за секој објект во формат:
    [идентификациски број]-[име] [тип на корисник] [салдо] (5 поени).

    Да се имплементира оператор -= кој како аргумент ќе прима реален број, што ќе ја означува провизијата која треба да се плати кон банката,
    односно да се одземе од салдото на сметката. (5 поени)

    Потоа, да се дефинира класа Bank во која се чуваат информации за:

        - Име на банка (текстуална низа од 20 знаци)
        - Листа од сметки (динамички алоцирана низа објекти од класата Account)
        - Број на сметки (број на елементи во низата од сметки, иницијално е 0)

    За оваа класа да се дефинираат потребните конструктори, деструктор, set и get методи. (5 поени).

    Оператор за печатење << во формат [име] и сите сметки поединечно. (види формат во тест примерите). (5 поени)

    Оператор += за додавање нова сметка во банката.
    Во банката сметките се менаџираат според нивниот идентификациски број кој е уникатен.
    Во банката не смее да се дозволи додавање нова сметка со идентификациски број кој веќе постои во банката (10 поени).

    Оператор < кој споредува две банки според бројот на сметки во банката. (5 поени)

    Да се дефинира метод void bankFee() - со кој банката наплатува месечна банкарска провизија за сите сметки на почеток на тековниот месец.
    Банкарската провизија се пресметува во зависност од тоа за каков тип на корисник се работи.
    За физички лица банкарската провизија изнесува 0.8% од парите кои се на сметката, а за правни лица банкарската провизија е 1.5% од парите кои се на сметката. (10 поени)

    Да се дефинира глобален метод leastLiquid() - кој прима низа од објекти од класатa Bank и бројот на банки, а ја враќа онаа банка која има најмал број на сметки.
    Доколку повеќе банки имаат ист број на сметки, се враќа онаа која е прва најдена. (5 поени)
*/
