/*
    Колоквиумски задачи (прв колоквиум 2023/2024)
    Прва задача (40 поени)

    Да се дефинира класа Call, во која ќе се чуваат информации:
    
    - за датумот на повикот (објект од класа Date),
    - времетраење во секунди (цел број), и
    - два телефонски броja (текстуални низи од 10 цифри за број кој повикува и баран број). (10 поени)

    Класата Date треба да содржи три цели броеви за ден, месец и година. (5 поени)

    Да се напише main функција во која се чита цел броj N (max 500), a потоа информации за N повици.
    Читањето на еден повик е во следниот формат:

    - dd mm yyyy
    - број_што_повикува
    - баран_број
    - времетраење (10 поени)

    Потоа, треба да се прочита уште еден датум кој означува почеток на временскиот период од тој датум до денес.

    Пример влез:

    18 03 2016
    070211123
    071300400
    73
    .... повици
    18 12 2017
    070211123
    071300400
    730
    11 11 2015

    На екран да се испечатат сите повици кои се пократки од 10 минути и се направени после внесен датум (не вклучувајќи ги и повиците на самиот тој датум).

    Да се искористи посебна функција која како аргументи прима:
    - низа од објекти од класата Call,
    - големина на низата со повици (цел број) и
    - датум (објект од класата Date) кој означува почеток на временскиот период.

    Доколку не постојат повици со бараниот услов, да се испечати соодветна порака. (15 поени)
*/
