/*
    Во програмскиот јазик C++ да се креира структура Pacient и истата треба да содржи: (5 поени)

    - Име и презиме на пациентот ( низа од макс. 100 знаци)
    - Дали е здраствено осигуран (1-да, 0-не)
    - Број на прегледи во текот на последниот месец (цел број)

    Да се креира структура MaticenDoktor, која во себе содржи: (5 поени)

    - Име на докторот (низа од 100 знаци)
    - Број на пациенти (цел број)
    - Листа од пациенти (низа од максимум 200 елементи од структурата Pacient)
    - Цена на преглед (децимален број)

    Да се креираат метода najuspesen_doktor, која прима низа од променливи од типот MaticenDoktor и нивниот број;
     - и го печати името,
     - заработената сума и
     - бројот на прегледи на оној доктор кој заработил најголема сума од пациенти кои ги прегледувал приватно (не се здраствено осигурани) (10 поени).

    Доколку два или повеќе доктори имаат иста сума, тогаш се печати оној доктор кој има направено најголем број на прегледи вкупно во текот на последниот месец. (20 поени)

    Функционалност (5 поени).
*/
