/*
    Да се дефинира структура RabotnaNedela во која се чуваат бројот на работни часови за секој работен ден во неделата (5 дена) и број на неделата.
    Потоа да се дефинира структура Rabotnik за кој се чува име (низа од 50 знаци) и низа од работни недели (макс 4).

    Да се имплементираат следните функции:

    - int maxNedela(Rabotnik *r) која за проследениот работник ќе го врати бројот на неделата со најмногу работни часови
    - void table(Rabotnik *r, int n) која за низата од работници ќе отпечати приказ во следниот формат:

    Пример

    Rab     1   2   3   4   Vkupno
    Brianna 192 238 226 225 881
    Ava     236 231 184 212 863
    Matthew 236 235 219 243 933
    Alyssa  240 254 217 228 939
    Emma    247 205 204 242 898

    каде во секој ред се печати името на работникот и вкупниот број на работни часови за секоја работна недела,
    како и вкупниот број на часови за сите недели. Во рамките на редот податоците се разделени со знак за табулатор \t.
*/
