/*
    За потребите на еден приватен банкар кој тргува со акции, потребно е да се направи модул за менаџирање со клиентски портфолија.

    За таа цел, треба да се креира класа StockRecord. Класата треба да содржи:

    - ID, кој означува која е акцијата која се тргува (низа од 12 знаци)
    - Име на компанијата која ја издала акцијата (низа од 50 знаци)
    - Цена според која се купени акциите (реален број)
    - Моментална цена на акцијата (реален број)
    - Број на акции кои се купени (цел број)

    За класата да се дефинираат потребните конструктори и set метода за моменталната цена со потпис void setNewPrice(double c) (10 поени).
    Исто така, да се имплементираат методи double value() и double profit(). Првата треба да ја пресметува вредноста на акциите,
    а втората треба да го пресметува моменталниот профит од акциите. Пресметката се врши на следниот начин (5 поени):

    - Вредност = број на акции * моментална цена
    - Профит = број на акции * (моментална цена - цена по која се купени)

    Дополнително, да се преоптовари операторот << за печатење на објектот во следниот формат (5 поени):
    Компанија БројНаАкции КуповнаЦена МоменталнаЦена Профит

    Да се креира класа Client која содржи:

    - Име и презиме на клиентот (низа од 60 знаци)
    - ID на сметка (цел број)
    - Низа од компании кои ги поседува клиентот (динамичка низа од објекти од класата StockRecord)
    - Број на објекти во низата (цел број)

    За класата Client да се дефинираат потребните конструктори, деструктор и метода double totalValue() која ќе ја
    пресметува моменталната вредност на акциите кои ги поседува клиентот.
    Таа се пресметува како збир од вредноста на сите акции од секоја компанија од кои е составено клиентското портфолио (15 поени).

    Дополнително, за класата да се преоптоварат операторите:

    - += за купување на нова компанија во портфолиото (додавање на нов објект од класата StockRecord во низата со компании) (10 поени)
    - << за печатење на информации за портфолиото на клиентот така што во првиот ред ќе бидат прикажани ID на сметката и
    моменталната вредност на портфолиото одделени со празно место, а во секој нареден ред ќе бидат прикажани компаниите
    од кои е составено портфолиото, секоја во посебен ред (5 поени)

    Комплетна функционанлост (5 поени)
*/
