/*
    Да се креира структура Igrac во која се чуваат податоци за еден играч на компјутерската игра.
    За играчот се чуваат:  (10 поени).

    - информации за корисничкото име на играчот (низа од 15 знаци)
    - број на ниво до кој играчот е стигнат (цел број) и
    - број на освоени поени (цел број)

    Потоа да се креира структура KompjuterskaIgra во која се чуваат:
    
    - податоци за името на играта (низа од 20 знаци),
    - низа од играчи кои ја играат играта (најмногу 30) и
    - бројот на играчи. (10 поени)

    Треба да се направи функција со потпис (15 поени)

    void najdobarIgrac(KompjuterskaIgra *lista, int n)
    Оваа функција треба да го испечати името на најдобриот играч на онаа игра која има најголема популарност (ја играат наjголем број на играчи).
    Најдобар играч е играчот кој има најголем број на освоени поени.
    Ако има повеќе играчи со ист максимален број на освоени поени, најдобар е играчот кој има достигнато најголемо ниво.

    Печатењето е во форматот: "Najdobar igrac e igracot so korisnicko ime XXXXX koj ja igra igrata YYYYYY".
    (XXXXXX е корисничкото име на најдобриот играч,а YYYYY е името на играта која ја играат најголем број на играчи)

    (Забелешка: секогаш ќе има точно еден најдобар играч)

    Функционалност на задачата и дополнување на main функцијата (10 поени)

    Забелешка: Задачата да се реши во програмскиот јазик C++
*/
