/*
    Да се креира класа за претставување на планинарско друштво во која ќе се чуваат:

    - информации за името на друштвото (динамички алоцирана низа од знаци),
    - број на поминати тури (цел број) и
    - број на членови во планинарското друштво (цел број).

    За оваа класа да се напише:

    - оператор + за собирање на две друштва што како резултат враќа друштво со број на членови еднаков на збирот од членовите од двете друштва,
        а останатите атрибути на резултантното друштво ги добиваат вредностите на соодветните атрибути од друштвото со поголем број на членови
    - оператори >, < за споредба во однос на бројот на членови во планинарските друштва
    - оператор << за печатење на информациите за планинарското друштво

    Да се напише функција што на влез прима низа од планинарски друштва и вкупен број на друштва во низата и
    го печати планинарското друштво што има најголем број на членови .

    For example:
    
    Input:

    Bistra 12 75
    Kozuv 15 89
    Kozjak 2 15

    Result:
    
    Ime: Kozuv Turi: 15 Clenovi: 164
    Najmnogu clenovi ima planinarskoto drustvo: Ime: Kozuv Turi: 15 Clenovi: 89
*/

