/*
    Да се дефинира класа Ucesnik за учесник во маратон за кој ќе се чуваат информации за:

    име (динамички алоцирана низа од знаци)
    пол (bool)
    возраст (цел број) (5 поени).
    За потребите на оваа класа да се преоптоварат потребните конструктори и да се напише соодветен деструктор. (10 поени)

    Дополнително за оваа класа да се преоптоварат:

    оператор за споредување > (споредува двајца учесници според возраста) (5 поени)
    операторот за проследување на излезен тек << кој ќе ги печати името, полот (машки/женски) и возраста, секој во посебен ред. (5 поени)
    Да се дефинира класа Maraton за кој се чуваат:

    локација (низа од максимум 100 знаци)
    низа од Ucesnik објекти (динмички алоцирана низа од објекти од класата Ucesnik)
    број на учесници (цел број) (5 поени).
    За потребите на оваа класа да се преоптоварат потребните конструктори и да се напише соодветен деструктор. (10 поени)
    Исто така да се имплементираат следните методи:

    оператор += за додавање нов Ucesnik на маратонот Maraton. (10 поени)
    prosecnoVozrast() вреќа просечена возраст на учесниците на маратонот (5 поени)
    pecatiPomladi(Ucesnik &u) ги печати сите учесници помлади од учесникот проследен како аргумент на методот. (5 поени)

    Input:
    5
    Skopje
    Elena 0 23
    Mitko 1 41
    Iskra 0 31
    Jovan 1 28
    Zoran 1 40

    Output:
    Elena
    zhenski
    23
    Iskra
    zhenski
    31
    Jovan
    mashki
    28
    32.6
*/