// Во програмскиот јазик C++ да се креира класа Pacient и истата треба да содржи: (5 поени)
//
// Име и презиме на пациентот ( низа од макс. 100 знаци)
// Дали е здраствено осигуран (1-да, 0-не)
// Број на прегледи во текот на последниот месец (цел број)
//
// Да се креира класа MaticenDoktor, која во себе содржи: (5 поени)
//
// Име на докторот (низа од 100 знаци)
// Број на пациенти (цел број)
// Листа од пациенти (низа од максимум 200 елементи од класата Pacient)
// Цена на преглед (децимален број)
//
// Да се креираат метода najuspesen_doktor, која прима низа од објкети од типот MaticenDoktor и нивниот број; и го печати името, заработената сума и бројот на прегледи на оној доктор кој заработил најголема сума од пациенти кои ги прегледувал приватно (не се здраствено осигурани) (10 поени). Доколку два или повеќе доктори имаат иста сума, тогаш се печати оној доктор кој има направено најголем број на прегледи вкупно во текот на последниот месец. (20 поени)
//
// Функционалност (5 поени).
//
// For example:
// Input 	Result
//
// 3
// Д-р.Јованка_Јовановска
// 3
// 300.00
// Јованова_Ивана 1 2
// Боцевска_Ивана 0 3
// Илиевска_Ангела 1 0
// Д-р.Петко_Петковски
// 1
// 50.00
// Ивановска_Цветанка 0 18
// Д-р.Трајче_Трајчев
// 3
// 300.00
// Крстевски_Филип 1 0
// Цветановски_Иван 1 10
// Ивановска_Цветанка 0 3
//
//
//
// Д-р.Петко_Петковски 900.00 18

#include <iostream>

int main() {
    return 0;
}

