/*
    Да се напише класа Ingredient која ги содржи следните податоци за една состојка:

    - name - име на состојката, динамички алоцирана низа од карактери;
    - quantity - количина
    - calories - колку калории содржи состојката

    - За класата да се напишат default конструктор, конструктор со аргументи, copy конструктор и десктруктор.
    - Метод кој што ќе го враќа бројот на калории на состојката: quantity*calories
    - Да се преоптовари операторот << за да ги печати објектите од класата во следниот формат: [name] [quantity]
    - Да се преоптовари операторот = .

    Потоа да се дефинира класата Dish, која ги содржи следните податоци:

    - ingredients - динамички алоцирана низа од Ingredient објекти
    - dishName - динамички алоцирана низа од цели karakteri
    - ingredientCount - број на состојки во јадењето

    За класата да се дефинираат конструктор со параметри, copy конструктор, деструктор, како и следните методи:

    - Метод getTotalCaloreis кој што ќе го враќа бројот на калории на специјалитетот за сите состојки
    - оператор + кој како резултат дава ново јадење со состојки од двете јадења
    - оператор += кој во јадењето ќе додава нови состојки
    - оператор == кој ќе проверува дали две јадења имаат ист број на калории
    - оператор << за печатење на објектот во следниот формат:

        Dish: Pizza
        - Tomato: 200g/ml
        - Cheese: 50g/ml
        Total Calories: 6500


    Да не се менува main функцијата.
    Се признаваат и решенија без динамичка алокација на меморија.
*/
