/*
    За потребите на една продавница за гитари, потребно е да се направи програма за менаџирање на магацинот.
    За таа цел, треба да се креира класа Gitara (5 поени). Класата треба да содржи:

    Сериски број (низа од 25 знаци)
    Набавна цена (реален број)
    Година на производство (цел број)
    Тип (низа од 40 знаци)
    Да се дефинира метод daliIsti кој како аргумент ќе добие објект од тип Gitara и ќе ги спореди двете гитари според нивниот сериски број (5 поени)

    Дополнително, за оваа класа да се направи функција pecati() за печатење на објектот во следниот формат (5 поени):

    [СерискиБрој] [Тип] [Цена]

    Да се креира класа Magacin (5 поени) која содржи:

    Име на магацинот (низа од 30 знаци)
    Локација на магацинот (низа од 60 знаци)
    Низа од гитари кои ги поседува магацинот (динамички алоцирана низа од објекти од класата Gitara)
    Број на објекти во низата (цел број)
    Година на отвoрање (цел број)
    За класата Magacin да се дефинира метод double vrednost() што ќе ја пресметува моменталната вредност на гитарите кои се наоѓаат во магацинот.
    Таа се пресметува како збир од вредноста на сите гитари од кои е составен магацинот (5 поени).

    Дополнително, за класата да се дефинираат функциите:

    -void dodadi(Gitara d) за сместување на нова гитара во магацин (додавање на нов објект од класата Gitara во динамички алоцираната низа со гитари) (10 поени)
    -void prodadi(Gitara p) за бришење на дадена гитара од магацинот (бришење на сите објекти кои се исти како аргументот проследен во фунцијата)(10 поени)
    -void pecati(bool daliNovi) за печатење на информации за магацинот така што во првиот ред ќе биде прикажано имете и локацијата на магацинот,
    а потоа во секој нареден ред ќе бидат прикажани гитарите кои се наоѓаат во магацинот.
    
    Доколку пратената променлива има вредност true ќе се печатат само гитарите кои имаат година на производство понова од годината на отварање на магацинот.
    Во спротивно се печатат сите гитари (5 поени).

    За класите да се дефинираат потребните конструктори, деструктор и сите останати методи за правилно функционирање на програмата (5 поени).
    Сите податочни членови во класите се приватни.

    Input: 2
    Output: ===== Testiranje na klasata Magacin so metodot print() ======
    Magacin1 Lokacija1
*/