/*
    Да се креира структура SkiLift во која се чуваат:

    - податоци за името на ски лифтот (низа од 15 знаци),
    - максимален број на корисници што може да опслужи на едно возење,
    - дали е пуштен во функција.

    Потоа да се креирa структура SkiCenter во која се чуваат:

    - податоци за името на скијачкиот центар,
    - држава во која се наоѓа (низи од 20 знаци),
    - низа од ски лифтови (макс 20) што ги има и
    - број на ски лифтови.

    Треба да се направи функција со потпис

    - void najgolemKapacitet(SkiCenter *sc, int n) која што ќе го отпечати ски центарот што има најголем капацитет
    за опслужување скијачи (вкупниот број на скијачи кои може да се опслужуваат во еден момент вкупно на сите ски лифтови во центарот).
    Доколку два ски центри имаат ист капацитет, тогаш се печати оној кој има поголем број на ски лифтови.
    Притоа треба да се испечатат во посебен ред името, државата и капацитетот на ски центарот.
    Кога се пресметува капацитет на еден ски центар во предвид се земаат само ски лифтовите кои се поставени дека се во функција.
*/
