/*
    =============================================================
    ЗАДАЧА 5
    =============================================================
    Програмата чита почетна сума пари и потоа запис на берзански тикери во формат:
    ticker broj_akcii koeficient, се до линија со '#'.

    Да се испечати тикерот со највисок коефициент заедно со неговиот број на акции и коефициент.
    Потоа да се испечати резултатот од множење на почетната сума со производот на сите коефициенти.

    Влез:
    1000
    AAPL 10 1.5
    MSFT 5 2.0
    #

    Излез:
    MSFT 5 2
    3000
    =============================================================
*/