/*
    =============================================================
    ЗАДАЧА 13
    =============================================================
    Дадена е матрица со m редови и n колони и цел број x.
    За секој ред, пресметај ја сумата на елементите.
    Ако сумата е поголема од x, замени ги сите елементи на тој ред со 1.
    Ако сумата е помала од x, замени ги со -1.
    Ако е еднакво, остави ги 0.
    Испечати ја резултантната матрица.

    Влез:
    5
    3 3
    1 2 3
    4 5 6
    1 1 1

    Излез:
    -1 -1 -1
    1 1 1
    -1 -1 -1
    =============================================================
*/