/*
    =============================================================
    ЗАДАЧА 18
    =============================================================
    Дадена е квадратна матрица n x n.
    Да се пресметаат:
    - x: сумата на елементите под главната дијагонала
    - y: сумата на елементите на и над споредната дијагонала

    Потоа да се создаде нова матрица каде:
    - на главната дијагонала се запишува x
    - на споредната дијагонала се запишува y
    - на пресекот на двете дијагонали се запишува x+y
    - сите останати елементи се 0
    Испечати ја резултантната матрица.

    Влез:
    3
    1 2 3
    4 5 6
    7 8 9

    Излез:
    (матрица со пресметани вредности)
    =============================================================
*/