/*
    =============================================================
    ЗАДАЧА 10
    =============================================================
    Дадена е матрица со n редови и m колони. За секоја колона j, да се пресмета бројот на елементи arr[i][j]
    кои се еднакви на конкатенацијата на бројот на редот i и бројот на колоната j
    (т.е. бројот формиран со поставување на цифрите на i пред цифрите на j).

    Да се испечати тој број за секоја колона.

    Пример:
    n=2, m=3
    0 1 2
    10 11 12
    Излез:
    2
    2
    2
    =============================================================
*/
