// 17. Задача
// Од тастатура се внесуваат димензиите на една матрица (m,n <= 100), а потоа и елементите од матрицата.
// Да се трансформира матрицата така што средниот елемент во секоја редица ќе се замени со разликата
// (по апсолутна вредност) на сумата на елементите во првата половина од редицата и
// сумата на елементите во втората половина на редицата.
// Ако матрицата има парен број колони, се менува вредноста на средните два елемента.
// Средниот/те елемент/и влегува/ат во сумите (при непарен број на колони,
// средниот елемент влегува во двете суми!).
// Да се испечати на екран променетата матрица.
