/*
    =============================================================
    ЗАДАЧА 10
    =============================================================
    Се чита цел број n и n линии на текст. За секоја линија се брои бројот на групи на последователни самогласки (низи
    самогласки должини >= 2).
    На крај се печати хистограм: за секој број на групи k (од 0 до максималниот), се печати бројот на линии кои го имаат тој број.
    Формат: k: brojNaLinii

    Влез:
    3
    aeiou
    hello
    beautiful

    Излез:
    0: 1
    1: 1
    2: 1
    =============================================================
*/