/*
    =============================================================
    ЗАДАЧА 2
    =============================================================
    Дадена е матрица со m редови и n колони. Нека min = min(m, n).
    За секое k од 2 до min, да се пресмета сумата на елементите кои го формираат горниот раб,
    споредната дијагонала и долниот раб на горната лева k×k подматрица (без дупликати на аглите).

    Односно: горниот ред (без последниот елемент), споредната дијагонала (i + j + 1 == k), и долниот ред (без првиот елемент).

    За секое k да се испечати оваа сума.

    Влез:
    3 3
    1 2 3
    4 5 6
    7 8 9

    Излез:
    8
    26
    =============================================================
*/