/*
    =============================================================
    ЗАДАЧА 12
    =============================================================
    Дадена е матрица со m редови и n колони.
    За секој ред i да се пресмета и испечати бројот на елементи за кои важи:
    збирот на нивниот индекс на ред и индекс на колона (i+j) е паренброен И вредноста на елементот е парна,
    ИЛИ
    збирот (i+j) е непарен И вредноста е непарна.

    Формат: i: broj

    Пример:
    m=2, n=3
    2 3 4
    5 6 7
    Излез:
    0: 2
    1: 2
    =============================================================
*/