/*
    =============================================================
    ЗАДАЧА 7
    =============================================================
    Се чита цел број n и n линии на текст. За секоја линија се брои колку пати се јавуваат два соседни согласки (букви кои не се самогласки).
    На крај се печати хистограм: за секој број на јавувања k (од 0 до максималниот), се печати бројот на линии кои го имаат тој број.
    Формат: k: brojNaLinii

    Влез:
    3
    street
    hello
    abcd

    Излез:
    0: 1
    1: 1
    2: 1
    =============================================================
*/