/*
    Од тастатура се вчитува природен број N, а потоа се вчитуваат последователно информации за N пиксели.
    За секој пиксел се внесуваат три цели броеви коишто ги претставуваат r, g и b вредностите за соодветниот пиксел.
    Пикселот е валиден ако секоја од внесените r, g и b вредности е во опсег [0, 255].
    Пикселите коишто не се валидни не се земаат во предвид.

    Да се имплементира max rgb филтер, којшто за секој валиден пиксел го наоѓа максимумот од вредностите r, g и b и
    секоја вредност на компонентите на истиот пиксел што е помала од максимумот ја заменува со нула.

    За секој валиден пиксел се печатат новите вредности по извршената трансформација.

    Влез:
    5
    200 100 30
    255 123 255
    100 100 100
    300 120 8
    40 80 255

    Излез:
    200 0 0
    255 0 255
    100 100 100
    0 0 255
*/
