/*
    =============================================================
    ЗАДАЧА 1
    =============================================================
    Да се напише програма која чита N зборови.
    За секој збор програмата проверува дали содржи барем еден специјален знак (знак кој не е буква и не е цифра) И дали е палиндром.
    Ако ги задоволува двата услова, се памти зборот ако е подолг од претходно најдениот.
    На крај се печати најдолгиот таков збор.
    Ако не постои, се печати "Nema!".

    Пример:
    N: 4
    Влез: a@a bb 1@1 c!c
    Излез: 1@1

    N: 3
    Влез: hello world abc
    Излез: Nema!
    =============================================================
*/