/*
    =============================================================
    ЗАДАЧА 9
    =============================================================
    Дадена е низа од n реални броеви.
    Да се пресмета вредноста на следниот израз кој се пресметува рекурзивно:
    Почнувај од последниот елемент, па наназад:
    f = a[n-1], потоа f = 1/f + a[i] за секој претходен елемент.
    Да се испечати крајната вредност.

    Влез:
    4
    1 2 3 4

    Излез: (пресметана вредност)
    =============================================================
*/