// 2.1 - 5
// Еден елемент се заматува ако се најде аритметичка средина на елементот и сите негови соседи.
// Сосед на еден елемент се сите елементи кои припаѓаат на матрицата и се  околу истиот елемент (хоризонтално, вертикално и дијагонално).
// Во датотеката input.txt е сместена матрица од реални броеви (3 < n,m < 50).
// Во првиот ред се дефинирани бројот на редици и колони на матрицата и во секој преостанат ред е внесен еден ред од матрицата.
// По читањето на матрицата, од стандарден влез се внесуваат и 2 пара координати на матрицата (ред и колона)
// кои го репрезентираат горниот-лев и долниот-десен елемент од регионот.
// Потребно е да генеирате нова матрица во која ќе ги заматите сите елементи кои припаѓаат на регионот.
// Новодобиената матрица, во истиот формат, треба да се запише во датотеката output.txt.
