/*
    =============================================================
    ЗАДАЧА 10
    =============================================================
    Програмата чита два знаци z1 и z2, а потоа линии на текст се до линија со '#'.
    За секоја линија да се испечати подниза меѓу (не вклучувајќи ги) првото јавување на z1 и последното јавување на z2.

    Влез:
    ( )
    (hello world)
    (abc)
    #

    Излез:
    hello world
    abc
    =============================================================
*/