/*
    =======================
    Task 8
    =======================

    Четиринасочник претставува квадратна матрица со зборови запишани хоризонтално и вертикално, одлево-надесно и оддесно-налево.

    Од стандарден влез се чита квадратна матрица од ред n (3 <= n <= 50) и потоа збор составен од максимум 10 букви.

    Да се одреди дали зборот се наоѓа во матрицата.
    Доколку постои, да се испечати локацијата на првата и последната буква.
    Ако постојат повеќе појавувања, се печати првото.
    Доколку не се пронајде зборот, се печати Not Found.
*/
