// Се внесуваат низи од значи од стандарден влез.
// Да се избројат и испечатат сите последнователни појавувања на соседни самогласки во речениците.
// Појавата на големи и мали букви да се игнорира.
// Пронајдените парови самогласки да се испечатат на екран, секој во нов ред со мали букви.
// Потоа во нов ред се печати бројот на појавувања на паровите самогласки.
// Читањето завршува кога ќе се прочита знакот #.
//
// Пример:
//
// IO is short for Input Output
// medioio medIo song
// #
// Излез:
//
// io
// ou
// io
// oi
// io
// io
// 6
