// 18. Задача
// За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2)
// и елементите на матрицата (реални броеви).
// Нека X e збирот од елементите под главната дијагонала во матрицата А.
// Нека Y е збирот од елементите под споредната дијагонала во матрицата А.
//
// Да се креира нова матрица B на следниот начин:
// сите елементи од главната дијагонала во матрицата B треба да имаат вредност X
// сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y
// ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y
// сите останати елементи во матрицата B имаат вредност 0
