/*
    =============================================================
    ЗАДАЧА 8
    =============================================================
    Дадена е матрица со m редови и n колони и цел број min.
    За секоја позиција (k, h) каде k+min <= m и h+min <= n, да се пресмета сумата на елементите кои
    го формираат горниот раб, споредната дијагонала и долниот раб на min×min подматрицата со горниот лев агол на (k, h).
    Резултатот да се запише на позицијата (k, h) во копија на матрицата.
    Сите останати позиции остануваат непроменети.
    Да се испечати резултантната матрица.

    Влез:
    3 3
    1 2 3
    4 5 6
    7 8 9
    2

    Излез:
    8 9 3
    11 5 6
    7 8 9
    =============================================================
*/