/*
    =============================================================
    ЗАДАЧА 9
    =============================================================
    Да се напише програма која чита линии на текст се до '#'.
    За секоја линија се брои бројот на групи последователни букви со должина максимум 3 (одделени со не-букви).
    Се памти и печати линијата со најголем таков број, заедно со бројот.

    Формат: brojGrupi: linija

    Пример:
    Влез:
    ab!cd!ef
    hello world
    a!bb!ccc!dddd
    #
    Излез: 3: ab!cd!ef
    =============================================================
*/