/*
    =============================================================
    ЗАДАЧА 5
    =============================================================
    Дадена е матрица со m редови и n колони и правоаголен регион дефиниран со горен лев агол (a, b) и долен десен агол (c, d).
    За секоја позиција (i, j) во тој регион да се замени вредноста со просекот на сите нејзини соседи
    (вклучувајќи ги и оние надвор од регионот ако постојат во матрицата).
    Сите останати позиции остануваат непроменети.
    Да се испечати резултантната матрица.

    Пример:
    m=3 n=3
    1 2 3
    4 5 6
    7 8 9
    Регион: 0 0 1 1
    
    Излез:
    3 3.5 3
    4 4.5 6
    7 8  9
    =============================================================
*/