/*
    =============================================================
    ЗАДАЧА 6
    =============================================================
    Дадена е рекурзивна функција која почнува од n, одоѓа наназад со чекор 3 до 0 (или помало),
    а потоа се враќа нагоре со чекор 3 сè додека не се врати до n.
    Да се напише програма која за даден цел број n го печати редоследот на посетените вредности.

    Влез: 9
    Излез: 9 6 3 0 3 6 9
    =============================================================
*/