/*
    =============================================================
    ЗАДАЧА 7
    =============================================================
    Да се напише програма која чита низа од N цели броеви и ги преуредува така што сите нула и позитивни броеви
    доаѓаат прво (во оригинален редослед), а потоа следат сите негативни (во оригинален редослед).
    Да се испечати преуреданата низа.

    Пример:
    N: 6, низа: -1 3 -2 4 0 -5
    Излез: 3 4 0 -1 -2 -5

    N: 4, низа: -3 -1 2 5
    Излез: 2 5 -3 -1
    =============================================================
*/