/*
    =============================================================
    ЗАДАЧА 14
    =============================================================
    Дадена е матрица со n редови и 2*n колони.
    Да се ресоздаде нова матрица со 2*n редови и n колони, каде горната половина е составена од левата половина
    на оригиналната матрица, а долната половина од десната половина.

    Влез:
    2
    1 2 3 4
    5 6 7 8

    Излез:
    1 2
    5 6
    3 4
    7 8
    =============================================================
*/