/*
    =============================================================
    ЗАДАЧА 5
    =============================================================
    Дадена е матрица со m редови и n колони. Нека min = min(m, n).
    За секое k од 2 до min, да се пресмета сумата на елементите кои го формираат левиот раб, главната дијагонала и
    десниот раб на горната лева k×k подматрица (без дупликати на аглите).
    Односно: левата колона (без последниот елемент), главната дијагонала (i == j), и десната колона (без последниот елемент).
    За секое k да се испечати оваа сума.

    Влез:
    3 3
    1 2 3
    4 5 6
    7 8 9

    Излез:
    8
    26
    =============================================================
*/