/*
    =============================================================
    ЗАДАЧА 3
    =============================================================
    Дадена е рекурзивна функција која почнува од n, одоѓа наназад со чекор 5 до 0 (или помало),
    а потоа се враќа нагоре со чекор 5 сè додека не се врати до n.
    Да се напише програма која за даден цел број n го печати редоследот на посетените вредности.

    Влез: 15
    Излез: 15 10 5 0 5 10 15
    =============================================================
*/