/*
    =======================
    Task 7
    =======================

    Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.

    Да се напише функција void premesti(a, n) која ги преместува сите негативни броеви на крајот на низата,
    при што редоследот на позитивните и негативните броеви останува непроменет.

    По преместувањето, да се испечати новодобиената низа.

    Пример:
    Влез:
    9
    1 3 -3 2 5 -7 9 0 3

    Излез:
    1 3 2 5 0 3 -3 -7 -9
*/
