/*
    =============================================================
    ЗАДАЧА 2
    =============================================================
    Програмата чита групи на цели броеви. Секоја група почнува со бројот на елементи n, а потоа следат n цели броеви.
    Читањето завршува кога n = 0.
    За секоја група да се испечати бројот кој има најголема прва цифра.

    Влез:
    3
    312 154 271
    2
    89 43
    0

    Излез:
    312
    89
    =============================================================
*/