// 2.1 - 1
// Од стандарден влез се чита цел број N (N<=100) и потоа N низи од знаци.
// Низите знаци содржат букви, цифри и специјални знаци (без знаци за празно место), а секоја од нив не е подолга од 80 знаци.
// Да се напише програма со која што на стандарден излез ќе се отпечати најдолгата низа,
// којашто е палиндром (се чита исто од од лево на десно и од десно на лево) и што содржи барем еден специјален знак.
// Ако нема такви низи, се печати "Nema!".
// Ако има две или повеќе низи што го задоволуваат овој услов, се печати првата низа којашто го задоволува условот.
