// 13. Задача
// Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви),
// како и елементите на матрицата со димензии M x N (цели броеви).
//
// Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
// Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
// Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
// Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0

// Input:
// 17
// 4 6
// 1 5 7 2 1 1
// 10 0 0 5 1 1
// 5 8 3 9 1 0
// 9 8 2 5 3 4
//
// Output:
// 0 0 0 0 0 0
// 0 0 0 0 0 0
// 1 1 1 1 1 1
// 1 1 1 1 1 1