/*
    =============================================================
    ЗАДАЧА 11
    =============================================================
    Дадена е матрица со m редови и n колони и цел број k.
    За секоја позиција (y, u) каде y+k <= m и u+k <= n, да се пресмета следната сума од k×k подматрицата
    со горен лев агол (y, u): сумата на левата колона, десната колона и главната дијагонала (без аглите кои се бројат двапати).
    Резултатот да се запише на позицијата (y, u) во копија на матрицата.
    Сите останати позиции остануваат непроменети.
    Да се испечати резултантната матрица.

    Влез:
    3 3
    1 2 3
    4 5 6
    7 8 9
    2

    Излез:
    15 11 3
    19 5 6
    7 8 9
    =============================================================
*/