/*
    =============================================================
    ЗАДАЧА 3
    =============================================================
    Да се напише програма која чита N линии на текст.
    За секоја линија се проверува дали содржи барем 2 појавувања на подниза "a1c" (нечувствителна на регистар).
    Ако да, линијата се печати со сите букви претворени во мали, а останатите знаци непроменети.

    Пример:
    N: 3
    Влез:
    A1Ca1cTest
    hello a1c world
    a1cXa1cYa1c
    Излез:
    a1ca1ctest
    a1cxa1cya1c
    =============================================================
*/