/*
    =============================================================
    ЗАДАЧА 1
    =============================================================
    Да се напише програма која чита линии на текст се до линијата која започнува со '#'.
    За секоја линија, да се најдат и испечатат сите парови на соседни самогласки (a, e, i, o, u) - претворени во мали букви.
    На крај да се испечати вкупниот број на такви парови низ сите линии.

    Влез:
    beautiful
    #

    Излез:
    ea
    ui
    2
    =============================================================
*/