/*
    =============================================================
    ЗАДАЧА 17
    =============================================================
    Дадена е матрица со m редови и n колони.
    За секој ред, пресметај ја апсолутната разлика помеѓу сумата на левата и сумата на десната половина.
    Ако n е парно, запиши ја таа разлика во двата средни елементи на редот.
    Ако n е непарно, запиши ја во средниот елемент.
    Испечати ја изменетата матрица.

    Влез:
    2 4
    1 2 3 4
    5 6 7 8

    Излез:
    1 1 1 4
    5 2 2 8
    =============================================================
*/