/*
    =============================================================
    ЗАДАЧА 8
    =============================================================
    Програмата чита линии на текст се до празна линија.
    Меѓу сите линии кои содржат повеќе од 2 цифри, да се најде онаа со најголема должина.
    Да се испечати подниза на таа линија помеѓу нејзината прва и последна цифра (вклучително).

    Влез:
    hello 123 world
    ab12c
    (празна линија)

    Излез: 123
    =============================================================
*/