/*
    =============================================================
    ЗАДАЧА 6
    =============================================================
    Да се напише програма која чита низа од N цели броеви.
    Низата се подредува растечки, а потоа се наоѓа и печати најмалиот елемент кој се јавува паренбројно пати.
    Ако таков елемент не постои, се печати: "Nitu eden element ne se pojavuva paren broj pati!"

    Пример:
    N: 6, низа: 3 1 2 1 3 3
    Излез: Najmaliot element koj se pojavuva paren broj pati e 1

    N: 3, низа: 1 2 3
    Излез: Nitu eden element ne se pojavuva paren broj pati!
    =============================================================
*/