/*
    =======================
    Task 6
    =======================

    Од стандарден влез се чита природен број N (N <= 100), како и низа од позитивни цели броеви a[ ] со N елементи.

    Да се напише функција int par(a, n) која ќе го врати најмалиот елемент во низата кој се појавува парен број пати.
    Доколку нема таков елемент, функцијата враќа вредност 0.

    Да се испечати соодветна порака според резултатот.

    Пример 1:
    Влез:
    12
    1 3 4 5 3 1 4 5 5 3 2 3

    Излез:
    Najmaliot element koj se pojavuva paren broj pati e 1

    Пример 2:
    Влез:
    12
    7 3 4 5 3 8 4 5 5 3 2 6

    Излез:
    Nitu eden element ne se pojavuva paren broj pati!
*/