/*
    =============================================================
    ЗАДАЧА 2
    =============================================================
    Да се напише програма која чита цел број N и го пополнува квадратна матрица со димензија ceil(sqrt(N)) x ceil(sqrt(N))
    со броевите од 1 до N по колони, наизменично: парните колони се пополнуваат одгоре надолу, непарните одоздола нагоре.
    Позиции по кои нема доволно броеви се пополнуваат со 0.
    Потоа матрицата се печати по редови.

    Пример:
    N: 6
    Излез:
    1 4 5
    2 3 6
    3 0 0

    N: 9
    Излез:
    1 6 7
    2 5 8
    3 4 9
    =============================================================
*/