// За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви).
// Нека X e збирот од елементите под главната дијагонала во матрицата А.
// Нека Y е збирот од елементите под споредната дијагонала во матрицата А.
// Да се креира нова матрица B на следниот начин:
//
// сите елементи од главната дијагонала во матрицата B треба да имаат вредност X
// сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y
// ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y
// сите останати елементи во матрицата B имаат вредност 0
// Новата матрица B да се испечати на стандарден излез.
//
// ПРИМЕР:
//
// Матрица A
// 58344.1425.595.14.15.51.1621.337.40.73.21.2132277.52.50.2601.8
//
// Матрица B
// 110.200049.50110.2049.5000159.700049.50110.2049.5000110.2
