/*
    Дадена е дел од дефиниција на класата StudentKurs.

    За секој студент кој слуша некој курс се чуваат информации за:

    - неговото име (низа од знаци),
    - оценка од писмен дел (цел број) и
    - дали студентот сака да биде испрашуван и усно (булова променлива).

    Оцената за писмениот дел е вредност од 1 до МАX. MAX има почетна вредност 10 која е иста е за сите и може да се промени со соодветна функција setMAX(). (5 поени)

    Кај оние студенти кои сакаат да бидат испрашувани усно и добиваат и описна оценка.
    Имплементирај соодветна класа StudentKursUsno во која се чуваат дополнителни информации за описна оценка на усното испрашување (динамичко алоцирана низа од знаци).
    Описни оценки може да бидат: odlicen, dobro, losho.... Ако описната оценка е odlicen тогаш оцената ќе биде
    најмногу за оценки 2 повисока од оценката од писмениот дел, ако е dobro оценката ќе биде најмногу за 1 повисока,
    а ако е losho за 1 пониска. Ако студентот добие некоја друга описна оценка, неговата оценка ќе остане иста со оценката од писмениот дел.

    Во класите StudentKurs и StudentKursUsno треба да се имплементираат потребните конструктори, функции за поставување и преземање и деструктор. (5 поени)

    За сите објекти од класите треба да се обезбедат следните функции:

    - преоптоварен оператор << во кој се печатат информации за студентот на курсот во формат: Ime --- ocenka (5 поени)
    - оcenka() – ја враќа оценката на студентот на курсот (5 поени)

    Во класата StudentKursUsno дефинирај ја функцијата:

    - преоптоварен оператор += за поставување на описна оценка на студентот(5 поени)
    Ако се направи обид да се внесе описна оценка во која покрај букви има и други знаци треба да се фрли исклучок (објект од класата BadInputException).
    Фатете го исклучокот во главната функција каде што е потребно. Откако ќе го фатите отпечатете соодветна порака
    за грешка (Greshna opisna ocenka) и справете се со исклучокот така што тие знаци ќе отстранат од стрингот
    со описната оценка (ако описната оценка била dо1ba0r ќе се промени во dоbar). (10 поени)

    Дадена е дел од дефиницијата на класата KursFakultet во која се чуваат информаци за името на курсот (низа од 30 знаци)
    и за студентите запишани на курсот (низа од 20 покажувачи кон класата StudentKurs) како и бројот на студенти запишани на курсот.

    Еден студент кој запишал некој курс ќе го положи курсот ако има барем MINOCENKA.
    Вредноста MINOCENKA е членка на класата StudentKurs и има фиксна вредност 6 која не може да се промени. (5 поени)

    Во класата KursFakultet имплементирај ги функциите:

    функција pecatiStudenti() во која се печатат сите студенти кои го положиле курсот, секој во посебен ред.
    Претходно во првиот ред се печати: Kursot XXXXX go polozile: (5 поени).

    функција postaviOpisnaOcenka(char * ime, char* opisnaOcenka) во која на студентот на курсот со даденото име му се поствува описна оценка.
    Ако тоа не е можно функцијата не прави ништо (15 поени).

    Комплетна функционалност (5 поени)
*/