/*
    Да се имплементира класа Trud во која се чуваат информации за: (5 поени)

    - вид на труд (еден знак и тоа C за конференциски труд, J за труд во списание)
    - година на издавање (цел број).

    Да се имплементира класа Student во која се чува: (5 поени)

    - името на студентот (низа од најмногу 30 карактери)
    - индекс (цел број)
    - година на упис (цел број)
    - листа на оцени од положени предмети (низа од цели броеви)
    - број на положени предмети (цел број)

    За оваа класа да се имплементираат следните методи:

    - функција rang() што пресметува просек од положените испити на студентот (5 поени)
    - оператор << за печатење на студентот во формат: (5 поени)
        Индекс Име Година на упис ранг

    Да се имплементира класа PhDStudent во која покрај основните информации за студентот дополнително се чува: (5 поени)

    - листа од објавени трудови (динамички резервирана низа од објекти од класата Trud)
    - бројот на трудови (цел број)

    Во оваа класа да се препокрие соодветно функцијата rang() така што на просекот од положените испити ќе се додаде и
    збирот од поените од објавените трудови на PhD студентот. Во зависност од видот на трудот, секој универзитет има посебен начин на бодување на трудовите.
    Начинот на бодување е ист за сите PhD студенти. Иницијално да се смета дека конференциски труд се бодува со 1 поен, а труд во списание со 3 поени.
    Универзитетот има можност да ги менува вредностите на бодовите. (5 поени + 5 поени)

    За оваа класа да се обезбеди:

    - оператор += за додавање нов објект од класата Trud во листата (5 поени).
    Ако се направи обид да се внесе труд што е издаден порано од годината на упис на студентот да се фрли исклучок (објект од класата Exception).
    Справувањето со исклучокот треба да се реализира во главната функција main каде што е потребно, но и во конструктор ако е потребно.
    Ако бил генериран исклучок треба да се отпечати соодветна порака за грешка "Ne moze da se vnese dadeniot trud",
    а новиот труд нема да се внесе во листата на трудови од студентот. (10 поени)

    Напомена: Сите променливи на класите се чуваат како приватни.

    Да се обезбедат сите потребни функции за правилно функционирање на програмата. (5 поени)
*/