/*
    Да се дефинира класа Vozac во која се чуваат информации за:

    - име (низа од максимум 100 знаци)
    - возраст (цел број)
    - број на трки (цел број)
    - дали е ветеран (да/не).

    Да се преоптоварат:

    - операторот << за печатење кој ќе ги печати името, возраст, бројот на трки и дали е ветеран (се печати VETERAN)
    - операторот == за споредување на два возачи според заработувачката по трка.

    Од оваа класа да се изведат две нови класи Avtomobilist и Motociklist.

    За автомобилистот дополнително се чува:

    - цена на автомобилот (децимален број).

    За мотоциклистот дополнително се чува:

    - моќност на мотор (цел број).

    Заработувачката по трка на возачите се пресметува како:

    - за автомобилостот заработувачката по трка е $\frac{CENA_{AVTOMOBIL}}{5}$
    - за мотоциклистот заработувачката по трка е $MOKJNOST_NA_MOTOR * 20$

    Секој автомобилист плаќа данок на заработка.

    Да се напишат соодветни методи за пресметување данок:

    - за автомобилисти: ако бројот на трки е поголем од 10 стапката на данок е 15% од заработката, инаку 10% од заработката.
    - за мотоциклисти: ако е ветеран стапката на данок е 25% од заработката, инаку 20% од заработката.

    Да се напше надворешна функција soIstaZarabotuvachka која како аргументи прима низа од покажувачи од класата Vocac,
    нивниот број, како и покажувач кон ојбект од возач и враќа како резултат бројот на возачи
    кои имаат иста заработувачка по трка со проследениот возач.
*/