// Од стандарден влез се задаваат димензиите на една матрица А mхn (m, n<=100) - бројот на колони во матрицата е >=3,
// а во продолжение се читаат елементите на матрицата. Елементите на матрицата се цели броеви.
// За секој ред во матрицата, потребно е да се провери дали елементите се во строго растечки редослед на парните позиции
// и во строго опаѓачки редослед на непарните позиции. Ова треба да се одреди со помош на рекурзивна функција.
// Рекурзивната функција на влез прима низа од цели брови и нејзината должина, а како резултат врака 1 ако условот е задоволен, инаку 0.
// Програмата печати информации дали условот е исполнет или не за секој ред во матрицата.
// На крај, го печати А-индексот на матрицата што се пресметува како бро на редици од матрицата за кои е исполнет условот.
// Максималниот број поени може да се добие само ако задачата се реши со рекурзивна функциа.
// Ако задачата се реши со нерекурзивна функциа, може да се добират максимум 15 поени.
// Напомена: Парните позиции во рамките на еден ред се (индекс 0, индекс 2, индекс 4 ити.), додека непарните позиции во рамките на еден ред се
#include <iostream>
using namespace std;

int process_row(int *arr, int n) {
    if (n < 3) {
        return 1;
    }

    int current_index = n - 1;
    int previous_index = current_index - 2;

    if (current_index % 2 == 0) {
        if (arr[previous_index] >= arr[current_index]) {
            return 0;
        }
    } else {
        if (arr[previous_index] <= arr[current_index]) {
            return 0;
        }
    }

    return process_row(arr, n - 1);
}


int main() {
    int m, n;
    cin >> m >> n;

    int A[100][100];

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cin >> A[i][j];
        }
    }

    int a_index = 0;

    for (int i = 0; i < m; i++) {
        if (process_row(A[i], n)) {
            cout << "Row " << i << " is valid." << endl;
            a_index++;
        } else {
            cout << "Row " << i << " is not valid." << endl;
        }
    }

    cout << "A-index: " << a_index << endl;

    return 0;
}
