// ──────────────────────────────────────────────────────────
// ЗАДАЧА 18  (zad18.cpp)
// ──────────────────────────────────────────────────────────
// Се читаат M (редови), N (колони), па M×N матрица цели броеви.
// Потоа се читаат R и K.
//
// Да се најде минималниот елемент во целата матрица
// Да се пополни горната лева под-матрица со димензии R×K со таа минимална вредност.
// Да се испечати модифицираната матрица.
//
// Влез:  M N, R K, па M×N матрица
// Излез: модифицирана M×N матрица

#include <iostream>
using namespace std;

int main() {
	int m, n, r, k;
	cin >> m >> n >> r >> k;

	int a[100][100];

	// читање
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			cin >> a[i][j];
		}
	}

	// наоѓање минимум
	int mn = a[0][0];

	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			if (a[i][j] < mn) {
				mn = a[i][j];
			}
		}
	}

	// пополнување R×K
	for (int i = 0; i < r; i++) {
		for (int j = 0; j < k; j++) {
			a[i][j] = mn;
		}
	}

	// печатење цела матрица
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			cout << a[i][j] << " ";
		}
		cout << endl;
	}

	return 0;
}
