// Од стандарден влез се внесуваат непознат број на реченици претставени преку текстуални низи (стрингови)
// секоја не подолга од 100 знаци и секоја во нов ред.
// Програмата треба да го најде стрингот кој содржи најмногу сврзници и да го испечати заедно со бројот на најдените сврзници.
// За сврзници се сметаат сите зборови составени од една, две или три букви.
// Зборовите во текстуалната низа се одделени со едно или повеќе прзани места и/или интерпункциски знак.
//
// Броењето на сврзници во дадена текстуална низа треба да се реализира во посебна функција.
// Решенијата без користење функција ќе бидат оценети со најмногу 40% од поените.
//
// Ако има повеќе реченици со ист максимален број на сврзници, се печати прво најдената.
//
// Објаснување на тест примерот:
// Бројот на сврзници по реченици е 2, 3, 4, 2, 4 и 7 соодветно.
// Најмногу сврзници има по последната реченица па се печати бројот 7 и содржината на таа реченица.
#include <cstring>
#include <iostream>
#include <cctype>
using namespace std;

int main() {
    char str[101];
    char max_str[101] = "";
    int max_count = -1;

    while (cin.getline(str, 101) && strlen(str) > 0) {
        int current_count = 0;
        int letter_count = 0;

        for (int i = 0; str[i] != '\0'; i++) {
            if (isalpha(str[i])) {
                letter_count++;
            } else {
                if (letter_count >= 1 && letter_count <= 3) {
                    current_count++;
                }
                letter_count = 0;
            }
        }

        if (letter_count >= 1 && letter_count <= 3) {
            current_count++;
        }

        if (current_count > max_count) {
            max_count = current_count;
            strcpy(max_str, str);
        }
    }

    cout << max_count << ": " << max_str << endl;


    return 0;
}
