/*
Од тастатура се внесува цел број X. Да се напише програма што ќе провери дали бројот X може да се претстави како збир на
два цели броја (a + b = X), така што за секој од броевите a и b важи следново: апсолутната разлика меѓу секои две соседни цифри
во бројот е еднаква на 1 (на пример: 12, 21, 232, 3434, 10). Се претпоставува дека секој од броевите a и b има најмалку две цифри.
Ако за внесениот број X постојат такви парови (a, b) броеви (барем еден), програмата ги печати сите што го исполнуваат условот
во растечки редослед според првиот број од парот и на крај печати „Yes“.
Паровите (a, b) и (b, a) се сметаат како ист пар и треба да се испечати само еден од нив (само парот (a, b)).
Ако не постои ниту еден таков пар, програмата печати „No“.

Влез:
66

Излез:
(10, 56)
(12, 54)
(21, 45)
(23, 43)
(32, 34)
Yes

*/
