/*
  ============================================================
  TASK 6 — Recursive Sequence (Step −3)
  ============================================================
  За даден број n да се испечати секвенцата:

    n n-3 n-6 ... n-6 n-3 n

  Без користење на циклуси.

  Input:
    16

  Output:
    16 13 10 7 4 1 -2 1 4 7 10 13 16
*/
#include <iostream>
using namespace std;

void sequence(int n) {
    // 1. Се печати моменталниот број при движење НАДОЛУ
    cout << n << " ";

    // Базен услов: Ако стигнеме до 0 или негативен број, тука запира намалувањето
    if (n <= 0) {
        return;
    }

    // 2. Рекурзивен повик со чекор -3
    sequence(n - 3);

    // 3. Се печати моменталниот број при враќање НАГОРЕ (Backtracking)
    cout << n << " ";
}

int main() {
    int n;
    cin >> n;

    sequence(n);

    return 0;
}
