// ──────────────────────────────────────────────────────────
// ЗАДАЧА 27  (zad27.cpp)
// ──────────────────────────────────────────────────────────
// Се чита N, па низа од N цели броеви (позитивни и негативни).
// Да се преуреди низата така што прво одат сите нула и позитивни броеви (во оригинален редослед),
// а потоа сите негативни броеви (исто во оригинален редослед).
// Да се испечати преуредената низа одделена со празни места.
//
// Влез:  N, па N цели броеви
// Излез: преуредена низа
//
// Пример:
// Влез :
// 6
// 3 -1 0 -4 2 -2
// Излез:
// 3 0 2 -1 -4 -2

#include <iostream>
using namespace std;

int main() {
	int n;
	cin >> n;

	int a[100];

	for (int i = 0; i < n; i++) {
		cin >> a[i];
	}

	int b[n];
	int count = 0;

	// Positive
	for (int i = 0; i < n; i++) {
		if (a[i] >= 0) {
			b[count++] = a[i];
		}
	}

	// Negative
	for (int i = 0; i < n; i++) {
		if (a[i] < 0) {
			b[count++] = a[i];
		}
	}

	// Print transformed
	for (int i = 0; i < n; i++) {
		cout << b[i] << " ";
	}

	return 0;
}
