/*
Од тастатура се внесува цел број X.

Да се напише програма што ќе провери дали бројот X може да се претстави како збир на два цели броја a + b = X,
такви што за секој од броевите a и b важи следново: збирот на парните цифри на бројот е еднаков на збирот на непарните цифри (на пример: 121, 336).

Се претпоставува дека секој од броевите a и b има најмалку две цифри.

Ако за внесениот број X постојат такви парови (a, b) броеви (барем еден),
програмата ги печати сите што го исполнуваат условот во растечки редослед според првиот број од парот и на крај печати „Yes“.

Паровите (a, b) и (b, a) се сметаат како ист пар и треба да се испечати само еден од нив (само парот (a, b), ако a <= b).

Ако не постои ниту еден таков пар, програмата печати „No“.

Пример:
Влез:
242

Излез:
(121, 121)
Yes

*/