// Од стандарден влез се чита природен број N (N <= 100), како и низа a[] од N цели броеви.
//
// Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
// По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа, а истото важи и за редоследот на негативните.
//
// Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.
//
// Пример.
//
// Влез
// 9 // бројот N на елементи
// 1 3 -3 2 5 -7 9 0 3 // елементи на низата
//
// Излез
// 1 3 2 5 0 3 -3 -7 -9 // добиената низа, после преместувањето
//
// For example:
// Input
// 9
// 1 3 -3 2 5 -7 -9 0 3
//
// Result
// 1 3 2 5 0 3 -3 -7 -9
//
// Input
// 10
// 8 1 5 7 10 100 36 85 14 2
//
// Result
// 8 1 5 7 10 100 36 85 14 2
#include <iostream>
using namespace std;

void replace(int a[], int n) {
	int b[n];
	int index = 0;

	for (int i = 0; i < n; i++) {
		if (a[i] >= 0) {
			b[index++] = a[i];
		}
	}

	for (int i = 0; i < n; i++) {
		if (a[i] < 0) {
			b[index++] = a[i];
		}
	}

	for (int i = 0; i < n; i++) {
		a[i] = b[i];
	}
}

int main() {
	int n;
	cin >> n;

	int a[100];
	for (int i = 0; i < n; i++) {
		cin >> a[i];
	}

	replace(a, n);

	for (int i = 0; i < n; i++) {
		cout << a[i] << " ";
	}
}
