#include <iostream>
using namespace std;

// =========================================================================
// Question 1
// =========================================================================

// Кои наредби ќе испечатат 11?
// Which statements will print 11?
// Question 1 Select one:

int A() {
    int p, x;
    for (x = -1, p = 0; ++x; p++) cout << p << x;
}

int B() {
    int p, x;
    for (x = -1, p = 0; x++; p++) cout << p << x;
}

int C() {
    int p, x;
    for (x = -1, p = 0; ++x; p += 2) cout << p << x;
}

int D() {
    int p, x;
    for (x = -1, p = 0; x++; p += 2) cout << p << x;
}

// =========================================================================
// Question 2
// =========================================================================

// Што ќе се отпечати со дадениот програмски сегмент:
// What will be the output?
void func() {
    for (cout << 1; cout << 3; cout << 2)
        break;
}

// =========================================================================
// Question 3
// =========================================================================

// Што ќе се испечати за променливите d и b по извршувањето на следниот код:
// What will be the output?
void func() {
    int a = 1, b = 2, c = 3, d;
    d = (a - b) && (c < b++);
    cout << "d=" << d << ", b=" << b;
}

// Select one:
// d=0, b=3
// d=0, b=2
// d=1, b=2
// d=1, b=3

// =========================================================================
// Question 4
// =========================================================================

// Што ќе се испечати по извршувањето на следниот програмски код:
// What will be the output?

void func() {
    int a = 2;
    switch (a) {
        case 6:
        case 4: cout << "baba ";
        case 2: cout << "dedo ";
        case 1: cout << "mama ";
            break;
        case 3:
        case 5: cout << "mia ";
            break;
        default: cout << "moja";
    }
}

// Select one:
// baba dedo
// baba moja
// mama mia
// dedo mama

// =========================================================================
// Question 5
// =========================================================================
// Кој е редоследот на излезот од следнава програма?
// What is the order of output of the following program?
#include <iostream>
using namespace std;

int swap(int x, int y) {
    int t;
    t = 0;
    x = y;
    y = t;
    cout << "Izlezot od funkcijata swap e:" << endl;
    cout << " x = " << x << " y = " << y << endl;
    y = 0;
    return 0;
}

int main() {
    int x = 10, y = 10;
    cout << "Izlezot od main e:" << endl;
    swap(x, y);
    cout << " x = " << x << " y = " << y << endl;
    return 0;
}

// Izlezot od main e:
// Izlezot od funkcijata swap e:
// x = 10 y = 0
// x = 10 y = 10

// =========================================================================
// Question 6
// =========================================================================
// Што ќе се испечати?
// What will be the output?
void func() {
    int a = 1, b = 1;
    int c = a || b;
    int d = a-- && b--;
    cout << a << b << c << d;
}

// Select one:
// 0101
// 0011
// 1010
// 1100

// =========================================================================
// Question 7
// =========================================================================
// Што ќе биде излезот после извршување на следниот код:
// What will be the output?

#include <iostream>
using namespace std;

int main() {
    int n = 15;
    for (; n < 17; ++n) cout << n;
    return 0;
}

// Select one:
// 1617
// ќе јави синтаксна грешка
// 1516
// 151617


// =========================================================================
// Question 8
// =========================================================================
// Што ќе се испечати за променливите d и b по извршувањето на следниот код:
// What will be the output?
void func() {
    int a = 1, b = 2, c = 3, d;
    d = (a - b) && (c < b++);
    cout << "d=" << d << ", b=" << b;
}

// Select one:
//
// d=1, b=2
// d=0, b=3
// d=0, b=2
// d=1, b=3

// =========================================================================
// Question 9
// =========================================================================
// Што ќе се отпечати со дадениот програмски сегмент:
// What will be the output?
void func() {
    int n = 10;
    while (n > 1)
        n /= 2;
    cout << n * n << endl;
}

// =========================================================================
// Question 10
// =========================================================================
// Што ќе се отпечати со дадениот програмски сегмент:
// What will be the output?
void func() {
    for (cout << 1; cout << 3; cout << 2)
        break;
}
