/*
    Од стандарден влез се задава димензијата на една матрица Аmxn (m,n<=100), а во продолжение се читаат елементите на матрицата.
    Елементите на матрицата се цели броеви.

    Да се испечатат сите збирови кои се добиваат со испишување на шаблонот за буквата N во матрицата A.
    Првиот шаблон се добива од подматрицата А1 (2x2) почнувајќи од индекс (0,0) во матрицата А,
    наредниот од подматрицата А2 (3x3) исто така почнувајќи од индекс (0,0) во матрицата А итн.

    Влез:
    4
    5
    1 2 3 4 5
    6 7 8 9 10
    11 12 13 14 15
    16 17 18 19 20

    Излез:
    16
    49
    100
*/

#include <iostream>
using namespace std;

int main() {
    int m, n;
    int a[100][100];

    cin >> m >> n;
    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cin >> a[i][j];
        }
    }

    int size = m < n ? m : n;

    for (int k = 2; k <= size; k++) {
        int sum = 0;

        for (int j = 0; j < k; j++) {
            for (int i = 0; i < k; i++) {
                if (j == 0 || j == k - 1 || i == j) {
                    sum += a[i][j];
                }
            }
        }

        cout << sum << endl;
    }
}
