/*
  ============================================================
  TASK 3 — Recursive Sequence (Step −5)
  ============================================================
  За даден број n да се испечати секвенцата:

    n n-5 n-10 ... n-10 n-5 n

  ЗАБЕЛЕШКА:
  - Забрането е користење на циклуси
  - Се користи рекурзија

  Input:
    16

  Output:
    16 11 6 1 -4 1 6 11 16
*/
#include <iostream>
using namespace std;

void sequence(int n) {
    // 1. Се печати моменталниот број при движење НАДОЛУ
    cout << n << " ";

    // Базен услов: Ако стигнеме до 0 или негативен број, тука запира намалувањето
    if (n <= 0) {
        return;
    }

    // 2. Рекурзивен повик со чекор -5
    sequence(n - 5);

    // 3. Се печати моменталниот број при враќање НАГОРЕ (Backtracking)
    cout << n << " ";
}

int main() {
    int n;
    cin >> n;

    sequence(n);

    return 0;
}
