/*
    =============================================================
    ЗАДАЧА 9
    =============================================================
    Да се напише програма која чита хексадецимални знаци (0-9, A-F, a-f) се до '.'.
    Да се пресмета децималниот збир на вредностите на сите прочитани знаци.

    Ако збирот е делив со 16 и збирот % 100 == 16, да се испечати "Poln pogodok".
    Ако е само делив со 16, да се испечати "Pogodok".
    Инаку да се испечати вредноста на збирот.
    За невалиден знак програмата завршува со порака "Invalid hexadecimal character!".

    Влез: A6.
    Излез: Pogodok

    Влез: 1.
    Излез: 1
    =============================================================
*/
