// 15. Задача
// Од тастатура се внесува колку студенти полагале колоквиум и потоа се внесуваат поените на сите кои полагале.
// Програмата треба да отпечати средна вредност на поените на сите студенти кои имале помалку од 50 поени,
// како и список на студентите со повеќе од 50 поени.
// Исто така програмата да отпечати средна вредност на поените на сите кои положиле со
// најмалку 50 поени инивните освоени поени
// (редоследот на печатење во двата случаеви треба да биде ист како и редоследот на внесување)
// Максималниот број на студенти што може да се внесат е 1000.