/*
    =============================================================
    ЗАДАЧА 12
    =============================================================
    Да се напише програма која чита цели броеви и по завршување на читањето печати на колку од прочитаните броеви
    нивната најголема цифра се наоѓа на позиција 0, 1, 2, 3 и 4 (позициите се броат од десно, почнувајќи од 0).

    Влез:
    123
    450
    789
    91

    Излез:
    0: 1
    1: 1
    2: 2
    3: 0
    4: 0
    =============================================================
*/
