/*
    =============================================================
    ЗАДАЧА 6
    =============================================================
    Да се напише програма која прво чита цел број z, а потоа чита парови на цели броеви се до парот (0, 0).
    Да се испечати колку парови имаат збир точно z и колкав процент од вкупниот број парови тоа претставува.

    Влез:
    5
    1 4
    2 3
    0 1
    0 0

    Излез:
    Vnesovte 2 parovi od broevi chij zbir e 5
    Procentot na parovi so zbir 5 e 66.6667%
    =============================================================
*/