// Од стандарден влез се задава димензија на една матрица Аmxn (m,n<=100), а во продолжение се читаат елементите на матрицата.
// Елементите на матрицата се цели броеви. Потоа се внесува уште еден цел број (големина на буквата N).
// Да се креира нова матрица M чии елементи се добиваат како збирови на елементите кои лежат на страните
// контурите на буквата N(должината на страните на буквата N- односно бројот на елементи кои треба да бидат земени во пресметката се внесува како параметар од командна линија)
// Секој елемент од новата матрица(Mij) е еднаков на збирот на елементите кои се наоѓаат во патеката на формирање на буквата N почнувајќи од соодветниот елемент во матрицата А
// Елементите за кои не може да се формира буквата N остануваат исти и во новокреираната матрица
// Новодобиената матрица M да се испечати на стандарден излез.
// Пример влез:
// 4
// 5
// 1
// 2
// 3
// 4
// 5
// 6
// 7
// 8
// 9
// 10
// 11
// 12
// 13
// 14
// 15
// 16
// 17
// 18
// 19
// 20
// 3
//
// Излез:
// 49
// 56
// 63
// 4
// 5
// 84
// 91
// 98
// 9
// 10
// 11
// 12
// 13
// 14
// 15
// 16
// 17
// 18
// 19
// 20