// 12. Задача
// Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри)
// се додекане се внесе нешто различно од број.
// За секој број треба да се најде позицијата (од десно на лево) на првото појавување на
// најголемата цифра во составот на бројот (цифрата на единици се наоѓа на позиција 0).
//
// Потоа, да се испечати статистика за позициите на најдените цифри со максимална вредност во следниот формат:
// [позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]
