/*
    =============================================================
    ЗАДАЧА 13
    =============================================================
    Да се напише програма која чита цели броеви и за секој прочитан број печати на која вредност е еднаква
    сумата на неговите цифри зголемена за највисоката цифра на претходно прочитаниот број
    (за првиот број придонесот од претходниот е 0).

    Формат: n: vrednost

    Влез:
    13
    25

    Излез:
    13: 4
    25: 10
    =============================================================
*/
