// Од стандарден влез се внесува цел број N (N<=100), а потоа се внесуваат N текстуални низи (реченици) со максимална должина од 100 знаци, секоја зададена во нов ред.
// За секоја од внесените реченици треба да се изброи колку вкупно пати последователно се појавуваат самогласки
//  На крај да се генерира извештај во кој ќе се наведе колку вкупно реченици имаат
// 0, 1, 2, … односно n појaвувања на последователни самогласки
// Во овој случај n е максималниот број на последователни појавувања на самогласки во некоја од речениците
// Излезот треба да биде во форматот како што е даден во примерот.
// Забелешка: Броењето на последователни појавувања на самогласки во реченицата  да се направи во посебна функција.
// Кај излезот првиот број ги значува последователните појавувања на самогласките(0 до n),
// а вториот број означува кај колку реченици од влезот е соодветниот број на последователни повторувања на самогласки.
// На пример во реченицата: Uste edna nоvaаа goооооdina ni dojdeееее.
// бројот на последователно појавување самогласки е:
// 3
// (обележани со задебелени букви)
