/*
    =============================================================
    ЗАДАЧА 10
    =============================================================
    Да се напише програма која чита цели броеви и печати само оние поголеми од 9 чии цифри формираат цик-цак низа,
    односно секоја цифра е строго поголема или строго помала од соседните, при што насоката се менува на секоја позиција.

    Влез:
    121
    123
    213
    12

    Излез:
    121
    213
    =============================================================
*/
