/*
    =============================================================
    ЗАДАЧА 2
    =============================================================
    Даден е цел број number поголем од 9.

    Да се напише програма која го наоѓа и печати најголемиот број помал од number за кој важи
    дека неговиот превртен запис е делив со бројот на неговите цифри.

    Ако number <= 9, да се испечати "Brojot ne e validen".

    Влез: 25
    Излез: 24

    Влез: 7
    Излез: Brojot ne e validen
    =============================================================
*/
