// 9. Задача
// Од стандарден влез се читаат непознат број на хексадецимални цифри се додека не се внесе точка (.).
// Ваша задача е да го пресметате декадниот збир на внесените хексадецимални цифри.
// Доколку добиениот декаден збир е делив со 16 се печати Pogodok.
// Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16 (последните цифри му се 1 и 6),
// се печати Poln pogodok инаку се печати самиот збир.

// Input:
// 0
// 1
// 0
// 0
// 0
// 1
// d
// 0
// 0
// 0
// 1
// .
//
// Output:
// Poln pogodok
