/*
    =============================================================
    ЗАДАЧА 5
    =============================================================
    Дадени се два позитивни цели броја a и b.
    Нека max е поголемиот, а min помалиот од нив.

    Да се напише програма која проверува дали бројот добиен со земање само на цифрите на парни позиции
    од max (позиции 2, 4, 6... броено од десно почнувајќи од 1), превртен, е еднаков на min.

    Ако да, да се испечати "PAREN", инаку "NE".
    Ако некој од броевите е <= 0, да се испечати "Invalid input".

    Влез: 6 12345
    Излез: PAREN

    Влез: -1 5
    Излез: Invalid input
    =============================================================
*/
