// 13. Задача
// Од тастатура се внесува број на студенти кои ќе полагаат колоквиум,
// а потоа и индексите (цели броеви) на сите студенти кои ќе полагаат колоквиум.
// Програмата треба да ги подели студентите во три групи:
// - студенти со индекси кои завршуваат на цифрата 0, 1 и 2;
// - студенти со индекси кои завршуваат на цифрата 3, 4, 5;
// - студенти со индекси кои завршуваат на цифрата 6, 7, 8, 9.
//
// Програмата треба да ги испечати индексите за секоја група, во истиот редослед како што биле внесени.
// Максималниот број на студенти што може да се внесат е 1000.