// Од стандарден влез се внесуваат две почетни низи од знаци обете со иста должина и тоа не поголема од 10 знаци.
// Потоа се внесува цел број N (N<=100), а во продолжение секоја во нов ред се внесуваат N текстуални низи (реченици) со максимална должина од 100 знаци.
// За секоја од внесените реченици треба да се направи замена на најдените знаци од првата почетна низа со карактерите на соодветната позиција од втората почетна низа.
// На крај да се испечатат новодобиените реченици.
// Забелешка: Замената на знаците во речениците да се направи во посебна функција.

// На пример во реченицата:
// Prva recenica!0
// Сите појавувања на знакот 0 треба да се заменат со *, на знакот е со q и на знакот ! со *
// Prva rqcqnica**

#include <iostream>
using namespace std;

void replace_chars(char str[], char str_a[], char str_b[]) {
	for (int i = 0; str[i] != '\0'; i++) {
		for (int j = 0; str_a[i] != '\0'; j++) {
			if (str[i] == str_a[j]) {
				str[i] = str_b[j];
				break;
			}
		}
	}
}

int main() {
	char str_a[10];
	char str_b[10];

	cin.getline(str_a, 10);
	cin.getline(str_b, 10);

	int n;
	cin >> n;
	cin.ignore();

	char str[100];

	for (int i = 0; i < n; i++) {
		cin.getline(str, 100);
		replace_chars(str, str_a, str_b);
		cout << str << endl;
	}
}
