/*
    =============================================================
    ЗАДАЧА 4
    =============================================================
    Да се напише програма која чита низа од знаци се до '!'.
    Да се испечати збирот на сите цели броеви кои се јавуваат во таа низа.
    Броевите се составени од последователни цифри, а сите останати знаци служат како разделувачи.

    Влез: ab12cd3!
    Излез: 15

    Влез: 100+200!
    Излез: 300
    =============================================================
*/
