/*
    =============================================================
    ЗАДАЧА 7
    =============================================================
    Даден е цел број number поголем од 2.
    Да се напише програма која печати правоаголна рамка со димензии number x number, каде горниот и долниот ред
    се составени од '%' на краевите и '@' помеѓу нив, а внатрешните редови имаат '%' на краевите и '.' помеѓу нив.

    Влез: 5
    Излез:
    %@@@%
    %...%
    %...%
    %@@@%
    =============================================================
*/
