package playground.еднодимензионални_податочни_структури;

/**
 * Апстрактен податочен тип (АПТ)
 * <p>
 * Апстрактниот податочен тип специфицира:
 * - кои вредности ги содржи;
 * - кои операции се достапни над тие вредности;
 * - како треба да се однесуваат операциите.
 * <p>
 * АПТ не пропишува како податоците ќе бидат претставени во меморијата
 * ниту како операциите ќе бидат имплементирани. Тој претставува договор
 * што го одделува однесувањето од конкретната имплементација.
 * <p>
 * Стекот, редицата и приоритетната редица се примери за АПТ.
 */
public interface AbstractDataType {
}