// TASK 12:
// Да се креира програма која што за вчитан датум од стандарден влез (во формат DD MM GGGG) ќе испечати на
// стандарден излез порака DA или NE во зависност од тоа дали внесениот датум е правилен или не.
// При одредување на валидноста на датумот во предвид да се земат сите фактори:
// - дали месецот е број помеѓу 1 и 12,
// - дали денот одговара со бројот на денови во тој месец,
// - доколку е 29.02. да се внимава дали станува збор за престапна година.
// Престапна година е секоја година која што е делива со 400 или пак е делива со 4, но не и со 100.

#include <iostream>
using namespace std;

bool is_leap_year(int y) {
	return (y % 400 == 0) || (y % 4 == 0 && y % 100 != 0);
}

bool is_valid_day(int d, int m, int y) {
	int days[13] = {0, 31, is_leap_year(y) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
	return d <= days[m];
}

bool is_valid_month(int m) {
	return m >= 1 && m <= 12;
}

int main() {
	int date, y, m, d;
	cin >> date;

	y = date % 10000;
	date /= 10000;

	m = date % 100;
	date /= 100;

	d = date % 100;
	date /= 100;

	if (is_valid_month(m) && is_valid_day(d, m, y)) {
		cout << "YES" << endl;
	} else {
		cout << "NO" << endl;
	}
}
