// TASK 7:
// Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
// - индекс (шестцифрен цел број)
// - шест оценки од последниот семестар кој го слушал.
//
// Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот:
// - просек на студентот (просекот да се испечати со точност од 3 децимали),
// - година на студии (студентите чијшто индекс почнува на 17 се трета година, на 16 се четврта година, на 15 се петта година итн.),
// - дали е награден (1 = награден, 0 = не е награден). Еден студент се наградува доколку има просек еднаков или поголем од 9.5

#include <iomanip>
#include <iostream>
using namespace std;

int main() {
    int index;
    cin >> index;

    int grades[6];
    int sum = 0;

    for (int i = 0; i < 6; i++) {
        cin >> grades[i];
        sum += grades[i];
    }

    cout << "Average grade: " << fixed << setprecision(3) << double(sum) / 6 << endl;
    cout << "Rewarded: " << (double(sum) / 6 > 9.5) << endl;

    int current_year = 26;
    cout << "Year of studies: " << current_year - index / 10000 << endl;
}
