// TASK 39: Од стандарден влез се чита позитивен непарен број n (n е најмалку 3) кој ги дава димензиите на квадратната
// матрица од цели броеви, која се чита во продолжение. Да се напише програма која од таа матрица(макс. 100 x 100) ќе
// креира нова матрица 2 x 2, која ќе ги има за елементи збировите на елементите на регионите на првата матрица,
// соодветно. Во продолжение на сликата може да видиме како се добиваат регионите за матрица кога n = 5. За оваа
// матрица, резултантната матрица би била: https://heckgaming.com/HBUuTx.png 17 28 16 28
