// Од стандарден влез се вчитува n (колку броја треба да има во низата), а потоа се внесуваат  секој од елементите на низата.
// На излез корисникот треба да отпечати секој елемент кој после него има најмалку два поголеми елементи.
//
// Пример:
// n=5, niza=[3,10,16,20,1]
//
// корисникот на излез треба да отпечати: 3 10, бидејќи 3 има 3 поголеми вредности, 10 има 2 поголеми вредности, но не и 16, бидејќи 16 има само една поголема вредност.
//
// For example:
// Input
// 8
// 7
// 12
// 9
// 15
// 19
// 32
// 56
// 70
//
// Result
// 7 12 9 15 19 32
// ------------------------
// Input
// 7
// 59
// 32
// 97
// 63
// 19
// 8
// 2
//
// Result
// 59 32
// ------------------------
// Input
// 7
// 88
// 12
// 9
// 15
// 3
// 12
// 1
//
// Result
// 9
// ------------------------
// Input
// 5
// 102
// 92
// 82
// 50
// 10
//
// Result
//
