// TASK 60:
// Да се напише програма во која корисникот внесува два цели броја.
// Програмата треба да ja најде нивната средна вредност.
// Потоа, програмата треба да го зголеми првиот број за вредноста на таа средна вредност, а вториот број да го намали за истата вредност.
// На крајот, да се испечати новата разлика меѓу броевите.
//
// For example:
//
// Input: 3 5
// Result: Razlikata e: 6
//
// Input: 11 9
// Result: Razlikata e: 22

#include <iostream>
using namespace std;


int main() {

}
