// Labs 2.3 - 31/10/2022
// Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
// - индекс (шестцифрен цел број)
// - шест оценки од последниот семестар кој го слушал
//
// Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот:
// - просек на студентот (просекот да се испечати со точност од 3 децимали)
// - година на студии (студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.)
// - дали е награден (1 = награден, 0 = не е награден) - Еден студент се наградува доколку има просек еднаков или поголем од 9.5
