// Да се напише програма која што ќе ги отпечати сите четирицифрени природни броеви
// кои се деливи со збирот на двата броја составени од првите две цифри и од последните две цифри на четирицифрениот број.
// На крајот треба да отпечати и колку вакви броеви се пронајдени.
// 3417 е делив со 34 + 17

#include <iostream>
using namespace std;

int main() {
    int count = 0;

    for (int i = 1000; i <= 9999; i++) {
        int sum = i / 100 + i % 100;
        if (sum > 0 && i % sum == 0) {
            cout << i << " ";
            count++;
        }
    }

    cout << endl;
    cout << "Divisible numbers count: " << count << endl;

    return 0;
}
