// Од стандарден влез се задава димензијата на една матрица Amxn (m,n<=100), а во продолжение се читаат елементите на матрицата.
// Елементите на матрицата се цели броеви.
//
// Да се испечатат сите збирови кои се добиваат со испишување на шаблонот за буквата N во матрицата А.
// Првио шаблон се добива од подматрицата А1 (2x2) почнувајќи од индекс (0,0) во матрицата А, наредниот од подматрицата А2 (3х3) исто почнувајќи од индекс (0,0).
//
// - Шаблон N
// - Шаблон Z

#include <iostream>
using namespace std;

int main() {
    int n, m;
    cin >> n >> m;

    int matrix[100][100];

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> matrix[i][j];
        }
    }

    int limit = min(n, m);

    // PATTERN N
    for (int k = 2; k <= limit; k++) {
        int sumN = 0;

        for (int i = 0; i < k; i++) {
            for (int j = 0; j < k; j++) {
                // j == 0              // прва колона
                // j == k - 1          // последна колона
                // i == j              // главна дијагонала
                if (j == 0 || j == k - 1 || i == j) {
                    sumN += matrix[i][j];
                }
                // x   x
                // x x x
                // x   x
            }
        }

        cout << sumN << endl;
    }

    // PATTERN Z
    for (int k = 2; k <= limit; k++) {
        int sumZ = 0;

        for (int i = 0; i < k; i++) {
            for (int j = 0; j < k; j++) {
                // i == 0              // прв ред
                // i == k - 1          // последен ред
                // i + j == k - 1      // споредна дијагонала
                if (i == 0 || i == k - 1 || i + j == k - 1) {
                    sumZ += matrix[i][j];
                }
                // x x x
                //   x
                // x x x
            }
        }

        cout << sumZ << endl;
    }

    return 0;
}
