// Од тастатура се внесува даден природен број N (каде N < 100000), и после него се внесуваат N други природни броеви.
//
// Да се најде сумата на цифрите кои се наоѓаат на првата (од десно на лево, односно цифрата на единици) позиција на првиот број,
// втората позиција на вториот број, потоа повторно првата позиција на третиот број, втората позиција на четвртиот број итн.
//
// Извлекувањето на цифрата од соодветната позиција (првата или втората позиција) да се имплементира во една посебна функција.
//
// Пример:
// 7
// 1234 234 5678 4567 45 7 6789
//
// Сума:
// 4 + 3 + 8 + 6 + 5 + 0 + 9 = 35

#include <iostream>
using namespace std;

int extract_digit(int n, int num_count);

int main() {
    int n;
    cin >> n;

    int sum_digits = 0;

    for (int i = 1; i <= n; i++) {
        int num;
        cin >> num;

        int digit = extract_digit(num, i);
        cout << digit << (i != n ? " + " : " = ");
        sum_digits += digit;
    }

    cout << sum_digits << endl;

    return 0;
}

int extract_digit(const int n, const int num_count) {
    if (num_count % 2 != 0) {
        return n % 10;
    }
    return n / 10 % 10;
}
