// Испреплетен максимум број може да се добие од било кои 2 позитивни цели броеви кои имаат цифри различни од 0.
// Секоја цифра од испреплетениот максимум број се добива преку споредување на цифрите на двата внесени броеви
// (првиот и вториот број), одејќи оддесно-налево, на следниот начин:
// - цифрата се зема од ПРВИОТ број ако левата соседна цифра од првиот број е поголема од левата соседна цифра од вториот број;
// - цифрата се зема од ВТОРИОТ број ако левата соседна цифра од вториот број е поголема од левата соседна цифра од првиот број;
// доколку левите соседни цифри од двата броја се еднакви, таа цифра се испушта и не се внесува во испреплетениот број.
// Доколку броевите имаат различен број на цифри, потребно е да се претпостави дека помалкуцифрениот број има цифри 0 пред најзначајната цифра (најлево).
// Од тастатура се внесува непознат број на парови од цели броеви се додека не се внесе нешто што не е број. Да се најде и испечати испреплетениот максимум број за секој од паровите внесени броеви.
// Така на пример испреплетен максимум број од броевите 123416 и 34517 е 2451.
//
// Објаснување:
//
// 123416
//  34517
// ------
//  2451
//
// Се споредуваат двата броја оддесно-налево. Најдесните цифри се 6 за првиот број и 7 за вториот број. Бидејќи левите соседи на цифрите 6 и 7 се исти (бројот 1) цифрите 6 и 7 не се внесуваат во испреплетениот број.
// Потоа постапката се повторува за цифрите лево. Во овој случај и двете се 1, но левите соседни цифри се 4 за првиот и 5 за вториот број. Се зема цифрата 1 од вториот број (5>4) и испреплетениот број моментално е 1.
// Истата постапка се повторува и за 4 и 5 и се внесува 5 (бидејќи левиот сосед на 5 (4) е поголем од левиот сосед на 4 (3). Испреплетениот број сега е 51.
// Постапката продолжува се додека не се изминат сите цифри.


