// Да се напише програма за пресметување и печатење на плоштината и периметарот на круг.
// Радиусот на кругот се чита од стандарден влез (тастатура) како децимален број.
//
// Периметар (L) (или обиколка) на круг се пресметува со формулата:
// L = 2 × π × r
//
// Плоштина (P) на круг се пресметува со формулата:
// P = π × r² каде r е радиусот на кругот, а π ≈ 3.14.

#include <iostream>
using namespace std;

#define PI 3.14159

int main() {
    double r;
    cin >> r;

    const double P = PI * r * r;
    const double L = 2 * PI * r;

    cout << "L = " << L << endl;
    cout << "P = " << P << endl;

    return 0;
}
