// Да се напише програма со која се внесува цел број n (n>0)
// а потоа ја пресметува сумата на серијата (n*n) + …+ (3*3) + (2*2) + (1*1) но САМО за парните членови.
// На излезот се отпечатуваат само парните членови, сумата и средната вредност на добиената серија од парните членови.
// Излезот е во дадениот формат (секој парен член, сумата и средната вредност во нови редови, нема празни места).

// Да се напише програма со која се внесува цел број n (n>0)
// а потоа ја пресметува сумата на серијата (n*n) + …+ (3*3) + (2*2) + (1*1), но САМО за НЕпарните членови.
// На излезот се отпечатуваат само непарните членови, сумата и средната вредност на добиената серија од непарните членови.
// Излезот е во дадениот формат (секој непарен член, сумата и средната вредност во нови редови, нема празни места).

#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;

    int sum_even = 0;
    for (int i = 0; i <= n; i++) {
        if (i % 2 == 0) {
            sum_even += i * i;
            cout << i << " ";
        }
    }

    cout << endl;
    cout << "Sum: " << sum_even << endl;
    cout << "Average: " << double(sum_even) / n << endl;

    int sum_odd = 0;
    for (int i = 0; i <= n; i++) {
        if (i % 2 != 0) {
            sum_odd += i * i;
            cout << i << " ";
        }
    }

    cout << endl;
    cout << "Sum: " << sum_odd << endl;
    cout << "Average: " << double(sum_odd) / n << endl;

    return 0;
}
