// Да се напише програма што проверува дали дадена година што се вчитува од тастатура
// е престапна или не и на екран печати соодветна порака.
//
// Примери за престапни години: 1976, 2000, 2004, 2008, 2012…
// ПОМОШ: Годината е престапна ако е делива со 4 но не е делива со 100, или пак ако е делива со 400.

#include <iostream>
using namespace std;

int main() {
    int year;
    cin >> year;

    const bool isLeap = year % 4 == 0 && year != 100 || year % 400 == 0;
    cout << year << (isLeap ? " is a leap year" : " is not a leap year") << endl;

    return 0;
}
