// Среден број е број кај кој секоја следна цифра е помала на претходната (гледајќи од најзначајната кон најмалку значајната).
// На пример, 7421. Едноцифрените броеви не се средни броеви.
//
// Да се напише програма во која прво се внесува број N кој го определува вкупниот број на броеви кои ќе бидат внесени од тастатура.
// Потоа се внесуваат N-те броеви, еден по еден.
//
// На излез, потребно е да се испечатат сите броеви кои го исполнуваат условот за среден број, а потоа да се отпечати и минималниот среден број од внесените броеви.
// Доколку не постои број кој го задоволува условот се печати вредност -1.
//
// Пример за влез:
// 5
// 435
// 643
// 12234
// 721
// 7720
//
// Пример за излез:
// 643
// 721
// 643

#include <climits>
#include <iostream>
using namespace std;

int is_middle_number(int n) {
    if (n >= 0 && n <= 9) {
        return false;
    }

    while (n >= 10) {
        int current = n % 10;
        int previous = (n / 10) % 10;
        if (current >= previous) {
            return false;
        }
        n /= 10;
    }

    return true;
}

int main() {
    int n;
    cin >> n;

    int nums[n];

    for (int i = 0; i < n; i++) {
        cin >> nums[i];
    }

    int min = INT_MAX;

    for (int i = 0; i < n; i++) {
        if (is_middle_number(nums[i])) {
            cout << nums[i] << endl;
            if (nums[i] < min) {
                min = nums[i];
            }
        }
    }

    cout << min << endl;
}

