// Да се напише програма во која од тастатура се внесува позитивен цел број N.
// Програмата треба да го испечати најголемиот делител (помал од бројот N) на бројот N кој содржи само парни цифри.
// Ако не постојат делители кои го задоволуваат условот програмата печати порака: “None”.
// Проверката дали даден број содржи само парни цифри да се реализира со посебна функција.
//
// Пример:
// N: 256
// Излез: 64
//
// N: 264
// Излез: 88
//
// N: 55
// Излез: None
#include <iostream>
using namespace std;

bool even_digits(int n);

int main() {
    int n;
    cin >> n;

    for (int i = n - 1; i > 0; i--) {
        if (n % i == 0 && even_digits(i)) {
            cout << i << endl;
            return 0;
        }
    }

    cout << "None" << endl;
    return 0;
}

bool even_digits(int n) {
    while (n > 0) {
        if (n % 10 % 2 != 0) {
            return false;
        }
        n /= 10;
    }

    return true;
}
