package playground.exercises._02_exe_arrays_lists;

/*
    Дадена е двострано поврзана листа од цели броеви.
    Дополнително, дадени се и уште еден цел број M и еден природен број k.
    Треба да се најде првото појавување на M во листата и тој број да се помести k места на десно.

    Влез: Во првиот ред од влезот е даден бројот на елементи во листата - N, па во следните следниот ред самите елементи одделени со празно место. На крај, во последните два реда дадени се целиот број M и природниот број k.
    Излез: На излез треба да се испечати листата пред и после промената.

    For example:
    Input 	Result

    5
    1 2 3 4 5
    3
    2

    1<->2<->3<->4<->5
    1<->2<->4<->5<->3


    9
    5 3 8 6 2 4 1 9 7
    4
    7

    5<->3<->8<->6<->2<->4<->1<->9<->7
    5<->3<->8<->4<->6<->2<->1<->9<->7


    10
    1 2 3 4 5 6 7 8 9 10
    11
    7

    1<->2<->3<->4<->5<->6<->7<->8<->9<->10
    Elementot ne postoi vo listata
    1<->2<->3<->4<->5<->6<->7<->8<->9<->10
*/
public class Exe10 {
}
