package playground.exercises._02_exe_arrays_lists;

/*
    За дадена двојно поврзана листа од N цели броеви, треба да се најде бројот на елементи такви што просекот на елементите од пред него во листата е поголем од просекот на елементи после него во листата.

    Влез: Првиот број од влезот е бројот на елементи во листата N, а потоа во следниот ред се дадени самите елементи одделени со празно место.
    Излез: Бројот на елементи што го задоволуваат условот.

    For example:
    Input 	Result

    5
    1 2 3 4 5

    0


    4
    5 4 3 2

    2
*/
public class Exe13 {
}
