package playground.exercises._02_exe_arrays_lists;

/*
    Дадена е еднострана поврзана листа чии што јазли содржат по еден String.
    Дополнително, даден е и уште еден природен број L.
    Од дадената листа потребно е да се најде последниот јазел којшто содржи String со должина L и да се премести на почеток на листата.

    Влез: Во првиот ред од влезот е даден бројот на елементи во листата - N, па во следните N редови се дадени самите елементи (String-ови) од листата. На крај, во последниот ред е даден бројот L.
    Излез: На излез треба да се испечати листата пред и после промената.

    For example:
    Input 	Result

    3
    Sky
    Blue
    Cloud
    5

    Sky->Blue->Cloud
    Cloud->Sky->Blue
*/

public class Exe6 {
}
