package playground.exercises._02_exe_arrays_lists;

/*
    Дадена е двострано поврзана листа од цели броеви.
    Дополнително, даден е и уште еден природен број k.
    Елементите во листата треба да се ротираат k пати на десно.

    Влез: Во првиот ред од влезот е даден бројот на елементи во листата - N, па во следните следниот ред самите елементи одделени со празно место. На крај, во последниот ред даден е и природниот број k.
    Излез: На излез треба да се испечати листата пред и после промената.

    For example:
    Input 	Result

    5
    1 2 3 4 5
    2

    1<->2<->3<->4<->5
    4<->5<->1<->2<->3



    4
    1 3 5 7
    4

    1<->3<->5<->7
    1<->3<->5<->7
*/
public class Exe7 {
}
