package playground.exercises._05_hashing;

/*
    Во оваа задача ќе работите со два објекти „Вработени“ и „Проекти“.

    Еден вработен е дефиниран со 2 вредности: Име (String), Возраст (цел број).

    Еден проект е дефиниран со 2 вредности: Работно Време (цел број), Плата по час (цел број).

    За даден проект вкупната плата се пресметува како производ на работното време и платата по час.

    Вработените ќе добиваат понудени проекти, и треба да го изберат проектот од кој ќе добијат најголема плата (доколку имаат избор од повеќе проекти со иста најголема плата, тогаш првиот таков).

    Ваша задача ќе биде да им помогнете на вработените со тоа што ќе искористите CBHT со 10 кофички каде што за секој вработен ќе ја чувате неговата најдобра понуда.

    За хеш функција користете производ од возраста на вработениот и ASCII вредноста на првата буква од името на вработениот.

    Влез:
    Во првиот ред е даден еден цел број N кој го означува бројот на понуди. Потоа во следните N редови се дадени по 4 вредности, информациите за понудите, името и возраста на вработениот и работното време и платата од час на проектот соодветно:

    N
    name_1 age_1 time_1 rate_1
    name_2 age_2 time_2 rate_2
    ...
    name_N age_N time_N rate_N

    Излез:

    Отпечатете ја целата табела (со готовиот toString метод).

    Секој вработен да се печати во формат "<name, age>" каде на местото на name и age треба да стои името и возраста на вработениот соодветно (имплементирајте го ова во toString метод)

    Секој проект да се печати во формат "<time, rate>" каде на местото на time и rate треба да стои работното време и платата по час на проектот соодветно (имплементирајте го ова во toString метод)

    Пример:
    Влез:

    5
    Martin 25 3 100
    Jana 26 4 90
    Martin 25 5 120
    Jana 26 2 95
    Nenad 20 6 80
    Излез:
    0:<<Nenad, 20>,<6, 80>>
    1:
    2:
    3:
    4:<<Jana, 26>,<4, 90>>
    5:<<Martin, 25>,<5, 120>>
    6:
    7:
    8:
    9:


    For example:
    Input 	Result

    5
    Martin 25 3 100
    Jana 26 4 90
    Martin 25 5 120
    Jana 26 2 95
    Nenad 20 6 80

    0:<<Nenad, 20>,<6, 80>>
    1:
    2:
    3:
    4:<<Jana, 26>,<4, 90>>
    5:<<Martin, 25>,<5, 120>>
    6:
    7:
    8:
    9:



    4
    Toni 45 10 500
    Toni 42 30 600
    Ana 20 10 300
    Jana 20 15 350

    0:<<Jana, 20>,<15, 350>> <<Ana, 20>,<10, 300>> <<Toni, 45>,<10, 500>>
    1:
    2:
    3:
    4:
    5:
    6:
    7:
    8:<<Toni, 42>,<30, 600>>
    9:



    20
    Martin 25 4 250
    Martin 27 5 270
    Jana 19 6 300
    Jana 21 7 330
    Nenad 33 9 400
    Nenad 35 8 370
    Slave 27 4 310
    Slave 29 6 340
    Milan 31 7 450
    Milan 33 9 490
    Marko 23 2 200
    Marko 25 3 220
    Jasna 29 8 410
    Jasna 31 9 420
    Ana 21 6 300
    Ana 23 8 350
    Mitko 35 5 360
    Mitko 37 7 400
    Vlade 29 6 370
    Vlade 31 8 450

    0:<<Nenad, 35>,<8, 370>>
    1:<<Marko, 23>,<2, 200>> <<Milan, 33>,<9, 490>> <<Slave, 27>,<4, 310>>
    2:
    3:
    4:<<Vlade, 29>,<6, 370>> <<Jasna, 31>,<9, 420>> <<Nenad, 33>,<9, 400>> <<Jana, 21>,<7, 330>>
    5:<<Mitko, 35>,<5, 360>> <<Ana, 23>,<8, 350>> <<Ana, 21>,<6, 300>> <<Marko, 25>,<3, 220>> <<Martin, 25>,<4, 250>>
    6:<<Vlade, 31>,<8, 450>> <<Jasna, 29>,<8, 410>> <<Jana, 19>,<6, 300>>
    7:<<Milan, 31>,<7, 450>> <<Slave, 29>,<6, 340>>
    8:
    9:<<Mitko, 37>,<7, 400>> <<Martin, 27>,<5, 270>>
*/

// Следните класи веќе се импортирани, не е дозволено копирање на класи овде, директно користејте ги како кога се достапни во други локални фајлови:

// CBHT, OBHT, MapEntry, SLLNode веќе се импортирани
import java.util.Scanner;

// Овде креирајте ги помошните класи за клуч и вредност
// Исполнете ги барањата од текстот за toString методите
// Дополнително осигурете се дека вашата клуч класа ќе ги имплементира потребните
// hashCode и equals методи

class Person {
    // поставете ги потребните полиња овде
    ...

    // имплементирајте соодветен конструктор
    Person(...) {
        ...
    }

    @Override
    public String toString() {
        // имплементирајте го toString методот според барањето во текстот
        ...
    }


    // имплементирајте ги следните два методи за да работи табелата правилно
    @Override
    public boolean equals(Object o) {
        ...
    }
    @Override
    public int hashCode() {
        ...
    }
}

class Project {
    ...

    Project(...) {
        ...
    }


    @Override
    public String toString() {
        ...
    }
}

public class Solution {
    public static void main(String[] args) {
        // Креирајте ја табелата според барањата
        ... table = new ...;

        // Прочитајте ги податоците од влезот и пополнете ја табелата


        // отпечатете ја вашата табела
        System.out.println(table);
    }
}

public class Exe1 {
}
