/*
    Да се креира класа која претставува слика (Image) во рамките на еден компјутер. За секоја датотека се чуваат (5 поени):

    име на сликата (дин. алоцирана низа од знаци). Предефинирано поставено на untitled.
    име на корисникот кој е сопственик на датотеката (низа од макс. 50 знаци). Предефинирано поставено на unknown.
    димензии на сликата (2 цели броеви кои претставуваат ширина и висина во пиксели). Предефинирано поставени на 800.
    Од класата Imageда се изведе класата TransparentImage, која претставува слика која содржи поддржува транспарентност.
    За транспарентна слика дополнително се чува :

    дали поддржува нивоа на транспарентност (bool променлива, предефинирано не поддржува транспарентност).
    За класите Image и TransparentImage да биде достапна метода (fileSize)за пресметка на големината на сликата (во бајти).
    Големината се пресметува на сл. начин (5 поени):

    за објектите од класата Image, големината на датотеката е еднаква на:висината * ширината * 3.
    за TransparentImage, доколку поддржува нивоа на транспарентност, големината на датотеката е еднаква на ширина * висина * 4.
    Доколку не поддржува транспарентност, големината на сликата се пресметува како ширина * висина + бр._на_пиксели_присутни_во_сликата / 8.
    За класите Image и TransparentImage да се преоптоварат следниве оператори (5 поени):

    оператор << кој ги печати податоците од датотеката во сл. формат:

    ime_fajl avtor golemina_na_fajlot_vo_bajti

    оператор > кој ги споредува сликите според нивната големина.

    Да се дефинира класа Folder, што репрезентира директориум во кој може да се поставуваат слики. За секој фолдер се чува (5 поени):

    име на фолдерот (низа од макс 255 знаци)
    име на корисникот кој е сопственик на фолдерот (низа од макс. 50 знаци). Предефинирано поставено на unknown.
    низа од покажувачи кон Image објекти (макс. 100 во рамките на еден фолдер).
    Да се имплементираат следниве методи (5 поени):

    метода за пресметка на големината на фолдерот (folderSize). Големината на фолдерот е сума од големините од сите слики во рамките на фолдерот.
    метода за пронаоѓање на наголемата слика во рамките на фолдерот (getMaxFile). Методата враќа покажувач кон најголемата слика во фолдерот (сметано во бајти).

    За класата Folder да се имплементира и оператор += кој додава објекти од типот Image/TransparentImage во рамките на фолдерот (5 поени).
    Да се креираат следниве функционалности за класите (5 поени):
    operator << - со кој се печатат податоците за фолдерот во формат (5 поени):

    ime_folder sopstvenik --
    imeslika avtor goleminanafajlotvo_bajti
    imeslika avtor goleminanafajlotvobajti -- goleminanafoldervo_bajti
    operator [] - кој враќа покажувач кон соодветната слика во фолдерот. Доколку не постои слика на тој индекс, треба да се врати NULL (5 поени).

    Да се креира и глобална функција max_folder_size која го прима низа од објекти од типот Folder и го враќа фолдерот кој има зафаќа најмногу простор (во бајти). (5 поени)

    Да се овозможи правилно функционирање на класите (потребни set или get методи/оператори/конструктори/деструктори) според изворниот код кој е веќе зададен.
    Сите податочни членови на класите се protected. (5 поени)

    Input:
    5
    folder
    user
    1
    2
    image1
    u1
    100 100
    1
    1
    2
    image1
    u1
    100 100
    0
    0

    Output:
    image1 u1 40000
*/
