/*
    Потребно е да се имплементира класа за компјутерска игра (Game), што содржи информации за:

    име на играта (низа од макс. 100 знаци)
    цена на играта (децимален број)
    дали е играта купена на распродажба (bool променлива).
    Од класата Game да се изведе класа SubscriptionGame, што дополнително ќе чува:

    месечен надоместок за играње (децимален број).
    датум кога играта е купена (месец и година како позитивни цели броеви)
    За класите Game и SubscriptionGame да се преоптоварат операторите за печатење (<<) и читање (>>).
    Да се дефинира и операторот == кој ќе споредува игри според нивното име.

    Да се дефинира класа за корисник (User) во која се чуваат:

    кориснично име на корисникот (низа од макс. 100 знаци)
    колекција од игри кои се купени од корисникот (динамички алоцирана низа).
    Да се преоптовари операторот += кој ќе овозможи додавање на нова игра во колекцијата на игри.
    Притоа ако корисникот ја има веќе купено играта, потребно е да се креира исклучок од типот ExistingGame.
    Класата за имплементација на исклучоци потребно е има соодветен конструктор и метода message за печатење на порака на екран.

    Да се креира и метода total_spent() во класата User која ќе пресметува колку пари корисникот потрошил за својата колекција од игри.
    Доколку играта е купена на распродажба, цената на играта е 30% од стандарната цена.
    Доколку играта е од типот SubscriptionGame, потребно е да се вкалкулира и сумата потрошена за месечниот надоместок
    (број_на_изминати_месеци x цена_на_месечен_надоместок) без да се земе во предвид моменталниот месец (мај 2018).

    Да се преоптовари и оператоторот за печатење на корисникот, која печати информации во сл. формат (види тест примери 7 до 12):

    User: username
    - Game: PUBG, regular price: $70, bought on sale
    - Game: Half Life 2, regular price: $70 - Game: Warcraft 4, regular price: $40, monthly fee: $10, purchased: 1-2017

    Листа на дел од методите со нивни прототипови кои се користат во main:

    ЕxistingGame::message()
    Game::operator==(Game&)
    User::operator+=(Game&)
    User::get_game(int)
    User::total_spent(int)
    User::get_name()
    User::get_games_number()

    Input:
    4
    World of Warcraft
    40
    0
    10
    1
    2017

    Output:
    Testing operator>> for SubscriptionGame
    Game: World of Warcraft, regular price: $40, monthly fee: $10, purchased: 1-2017
*/
