package playground.exercises._06_trees;

/*
* Во следната задача треба да изградите неподредено (општо) дрво со N јазли, за кое ќе треба да одговорите на Q прашања од видот „колку лисја има поддрвото на избран јазол“.

Секој јазол ќе има уникатен индекс од 1 до N. Коренот на дрвото секогаш ќе има индекс 1. Сите деца ќе имаат индекси поголеми од индексите на родителите.

Влезот ќе содржи N+Q редови од видот

    root 1 - Треба да го поставите коренот на дрвото да биде јазелот со индекс 1

    add parent_index child_index - Треба да додадете дете јазел со индекс child_index на јазелот со индекс parent_index

    ask node_index - Треба да одговорите колку листови има во поддрвото на јазелот со индекс node_index

Пример и структура на влезот:

Влез


Објаснување


Излез

11 5
root 1
add 1 2
add 2 3
ask 1
add 1 4
add 2 5
add 3 6
ask 2
add 3 7
ask 1
add 1 8
add 4 9
add 2 10
add 4 11
ask 2
ask 1


Прикажано е изгледот на дрвото при секое од 5те прашања во влезот

прашање 1

    прашање 1: ask 1: Во поддрвото на јазелот 1 има 1 лист.
    прашање 2: ask 2: Во поддрвото на јазелот 2 има 2 листови.
    прашање 3: ask 1: Во поддрвото на јазелот 1 има 4 листови.
    прашање 4: ask 2: Во поддрвото на јазелот 2 има 4 листови
    прашање 5: ask 1: Во поддрвото на јазелот 1 има 7 листови



1
2
4
4
7

For example:
Input 	Result

11 5
root 1
add 1 2
add 2 3
ask 1
add 1 4
add 2 5
add 3 6
ask 2
add 3 7
ask 1
add 1 8
add 4 9
add 2 10
add 4 11
ask 2
ask 1



1
2
4
4
7
*
* */
public class Exe1 {
}
