/*
    2.1 Class

    Да се напише класа за опис ученици.

    За секој ученик се чува името, просекот (децимален број) и школска година (цел број).

    За оваа класа да се имплементираат:

    - Конструктори и деструктор
    - Оператор ++ за зголемување на запишаната школска година за еден
    - Оператор << за печатење на ученик со сите негови податоци
    - Оператор > за споредување на два ученика според просекот

    Потоа треба да се креира класа за опишување на паралелка што содржи вектор од ученици.

    За оваа класа да се имплементираат:

    - Конструктори и деструктор
    - Оператор += за додавање на нов студент во паралелката
    - Оператор ++ за зголемување на запишаната школска година за еден за сите студенти во низата
    - Оператор << за печатење на сите ученици во паралелката Метод award што ги печати само оние ученици кои имаат просек 10.0.
    - Метод highestGPA што го печати највисокиот просек во паралелката
*/
