/*
    2.1 Array

    Да се напише класа Array за работа со вектор од целобројни елементи.

    Во класата да се преоптоварат следните оператори:
    += за додавање нови броеви во векторот и притоа ако е исполнет капацитетот на векторот (низата) да се зголеми за 100%.
    -= која ги брише сите појавувања на целоброниот аргумент во низата, а притоа капацитетот да не се промени.
    << за печатење на елементите од низата.
    - [] за пристап до елемент од векторот, доколку индексот не е валиден да се фрли исклучок (објект од класата IndexOutOfRangeException).
    - == за споредба на два објекти од класата Array за еднаквост на векторите.

    Да се тестира класата во main функција.
*/
