/*
    Да се дефинира класа Potpisuvac во која се чуваат информации за:

    - име (низа од максимум 20 знаци)
    - презиме (низа од максимум 20 знаци)
    - ЕМБГ (низа од максимум 14 знаци)
    - За класата да се дефинира copy конструктор, default конструктор и конструктор со аргументи.

    Да се дефинира класа Dogovor, во која се чуваат информации за:

    - број на договор (int),
    - категорија на договор (низа од 50 знаци),
    - поле од 3 потпишувачи на договорот (објекти од класата Potpisuvac)
    - Во класата да се додаде метод кој ќе проверува дали постојат два исти потпишувачи (имаат ист ЕМБГ).
*/
