/*
    Со цел да се подобри системот Мој Термин, со воведување функционалност за пресметување плати за лекарите за еден месец,
    од Министерството за здравство на Република Македонија, ги добивате следните задачи:

    Да се креира класа Lekar во која што ќе се чуваат:

    - факсимил на докторот (цел број)
    - име (низа од максимум 10 знаци)
    - презиме (низа од максимум 10 знаци)
    - почетна плата (децимален број)

    За класата да се имплементираат методите:

    - void pecati(): Печати информации за лекарот во формат Факсимил: име презиме
    - double plata(): ја враќа платата на лекарот

    Да се креира класа MaticenLekar која што наследува од Lekar и во неа се чуваат дополнителни информации за:

    - број на пациенти со којшто лекарот соработувал во текот на месецот (цел број)
    - котизации наплатени од пациентите во текот на месецот (динамички алоцирана низа од децимални броеви)

    За класата да се препокријат методитe:

    - void pecati() : ги печати основните информации за лекарот, а во нов ред го печати и просекот од наплатените котизации
    - double plata(): ја враќа платата на матичниот лекар

    Платата на матичниот лекар се пресметува со зголемување на основната плата за 30% од просекот од наплатените котизации за месецот
*/
