/*
Да се дефинира класа Subject  за која се чува:

   - име (низа од карактери)
   - број на кредити (цел број)

   За класата да се дефинира default конструктор, конструктор со аргументи и copy конструктор.

   Потоа да се дефинира класа Student за која се чува:

   - име (низа од карактери)
   - презиме (низа од карактери)
   - индекс (низа од карактери)
   - 5 предмети што ги слуша (низа од објекти од класата Subject)
   - метод total() што ќе го пресметува вкупниот број на кредити што ќе ги има студентот откако ќе ги положи предметите
   - метод display() кој што ќе испечати информации во формат:
   - Име презиме -> индекс -> кредити

   За класата да се дефинира  default конструктор и конструктор со аргументи.

   По потреба може да се креираат get и set методи.

   Да не се менува main функцијата.
*/
