/*
    1.3

    Да се креира структура Item во која што ќе се чуваат податоци за еден производ од продавница.
    За производот ќе се чуваат информации за име и цена на производот.

    Потоа, да се креира структура ShoppingCart во која што ќе  се чуваат податоци за
    id на кошничката и сите производи кои се дел од таа кошничка за купување.

    На почетокот се внесува број N што озналува колку кошнички ќе се читаат од влез.

    Да се направат функциите:

    void printAveragePriceOfLowestItems(...):
    која што ќе ги земе производите со најмала цена од секоја кошничка, ќе ја пресмета нивната средна вредност и ќе ја испечати.

    void printHighestPricedItem(...):
    кoja што за секоја кошничка ќе го испечати името на производот со најголема цена и id-то на кошничката од кој што доаѓа тој производ.
*/