/*
    Да се дефинира класа Book во која ќе се чуваат информации за:

    - Насловот на книгата (тип: string, со default вредност "TEST BOOK")
    - Бројот на страници кои се прочитани (тип: integer, со default вредност 0)

    За класата да се дефинираат:

    - Конструктори (согласно кодот во main методот)
    - readPages(int pages) - метод кој додава број на прочитани страници. Да се внимава прочитаните страници да не го надминат вкупниот број на страници за 200.
    - print() - метод кој ги печати информациите за книгата во следниот формат:
        TITLE - READ_PAGES/200 - STATUS, каде што статус може да биде:
            - IN PROGRESS (ако се прочитани помалку од 100 страници)
            - ALMOST DONE (ако се прочитани 100 или повеќе страници, но помалку од 200)
            - FINISHED (ако се прочитани сите 200 страници)
*/