/*
    Да се дефинира класа Camera во која ќе се чуваат податоци за една камера:

    - модел (низа од карактери не подолга од 20 карактери)
    - мегапиксели (цел број)
    - година на производство (цел број)

    За класата да се дефинира:

    - default конструктор
    - конструктор со аргументи
    - copy конструктор
    - деструктор
    - get и set методи (доколку има потреба од истите)

    Исто така да се дефинира функција за печатење на информации за класата која ќе печати во следниот формат:

    (модел) (мегапиксели)MP produced in: (година)

    Потоа да се дефинира класа Photographer во која се чуваат следните информации:

    - име (низа од карактери не подолга од 20 карактери)
    - презиме (низа од карактери не подолга од 20 карактери)
    - камера (објект од класа Camera)

    Да се креира:

    - default конструктор
    - конструктор со аргументи
    - деструктор
    - get и set методи (доколку има потреба од истите)

    Исто така да се дефинира функција за печатење на информации за класата која ќе печати во следниот формат:

    (име) (презиме) shoots with the camera: (информации за камерата)

    ДА НЕ СЕ МЕНУВА MAIN ФУНКЦИЈАТА!!!
*/
