/*
    Да се дефинира класата Film во која се чуваат информации за:

    - име на филмот (динамички алоцирано поле од знаци)
    - мемориската зафатнина на филмот изразена во MB
    - жанр на филмот кој може да биде: акција, комедија или драма (енумерација zanr)
    - Да се обезбедат сите потребни методи за класата за правилно функционирање на програмата.

    Дополнително за оваа класа да се дефинира функцијата:

    - pecati() - функција во која ќе се печатат одделени со цртичка(-): мемориска зафатнина на филмот со постфикс MB и името на филмот во наводници.

    Да се креира класата DVD во која се чуваат информации за :

    - низа од филмови снимени на DVD-то (Поле од најмногу 5 објекти од класата Film )
    - број на филмови снимени на DVD-то
    - меморискиот капацитет на DVD-то (во MB)

    Да се обезбедат сите потребни методи за класата за правилно функционирање на програмата.
    Дополнително за оваа класа да се дефинираат методите:

    - dodadiFilm (Film f) - со кој се додава филмот f на DVDто, но само ако има доволно преостанато место
        (земајќи го предвид меморискиот капацитет на DVD-то и мемориската зафатнина на снимените филмови) и притоа да има помалку од 5 филмови на DVD-то.
    - pecatiFilmoviDrugZanr(zanr z) – со кој се печатат информациите за сите филмови кои НЕ се од жанрот zanr (акција, комедија или драма).
    - (дополнително барање):float procentNaMemorijaOdZanr(zanr z)- со кој се пресметува процентот на меморијата која ја зафаќаат филмовите од жанр z на DVD-то.
*/
