/*
    Во оваа задача е потребно да уредите даден дом со маси.

    Креирајте класа Masa со следниве атрибути:

    - должина (целобројна вредност)
    - ширина (целобројна вредност)
    - конструктор со и без параметри и метода pecati().

    Креирајте класа Soba која содржи:

    - маса (објект од класата Маса)
    - должина на собата (целобројна вредност)
    - ширина на собата (целобројна вредност)
    - конструктор со и без параметри и метода pecati() во која се повикува и pecati() за објектот Masa.

    Креирајте класа Kukja со атрибути:

    - соба (објект од класата Soba)
    - адреса (низа од 50 знаци), и соодветни методи.
    - конструктор со и без параметри, деструктор и метода pecati() во која се повикува и pecati() за објектот Soba.
*/
