/*
    1) Да се креира структура Engine во која што ќе се чуваат податоци за коњска сила / horsepower (int) и вртежен момент / torque (int).

    Потоа, да се креира структура Car во која што ќе  се чуваат податоци името на производителот (char array),
    која година е произведена колата (int) и кој мотор / engine (Engine) која што го користи/

    На почетокот се внесува број N што озналува колку коли ќе се читаат од влез.

    Да се направи функцијата:

    - void printCars(...)

    која што ќе ги земе двете коли кои имаат најмала коњска сила, и од нив две, ќе ја испечати колата што има поголем вртежен момент.

*/