/*
    Да се дефинира класа Agol, во која се чуваат информации за:

    - степени (int)
    - минути (int)
    - секунди (int)

    Во класата да се реализираат:

    - конструктор по потреба
    - методи за поставување на вредности на атрибутите на класата (set методи)
    - метод за пресметување на вредноста на аголот во секунди

    Да се дефинира и метод за проверување на тоа дали внесениот агол е валиден,
    односно дали се внесени соодветни вредности за атрибутите (во границите кои ги дозволуваат).
*/
