/*
    Потребно е да се имплементираат класи File (датотека) и Folder (директориум) за работа со едноставен датотечен систем.

    Во класата File треба да се чуваат следниве податоци:

    - Име на датотеката (динамички алоцирана низа од знаци)
    - Екстензија на датотеката (енумерација со можни вредности: txt, pdf, exe)
    - Име на сопственикот на датотеката (динамички алоцирана низа од знаци)
    - Големина на датотеката (цел број на мегабајти)

    Дополнително, во класата потребно е да се напишат и:

    - Конструктор без параметри
    - Конструктор со параметри
    - Конструктор за копирање
    - Деструктор
    - Преоптоварување на операторот =
    - Метод за печатење на информациите за една датотека (видете го излезот од тест примерите за структурата на печатење) - print()
    - Метод за проверка на еднаквост помеѓу две датотеки со потпис bool equals(const File & that) кој ќе враќа true ако датотеките имаат исто име, екстензија и сопственик
    - Метод за споредба на типот помеѓу две датотеки со потпис bool equalsType(const File & that) кој ќе враќа true ако датотеките се од ист тип, т.е. имаат исто име и екстензија

    Во класата Folder треба да се чуваат следниве податоци:

    - Име на директориумот (динамички алоцирана низа од знаци)
    - Број на датотеки во него (на почеток директориумот е празен)
    - Динамички алоцирана низа од датотеки, објекти од класата File

    Дополнително, во класата потребно е да се напишат и:

    - Конструктор со потпис Folder(const char* name)
    - Деструктор
    - Метод за печатење на информациите за еден директориум (видете го излезот од тест примерите за структурата на печатење) - print()
    - Метод за бришење на датотека од директориумот со потпис void remove(const File & file) кој ќе ја избрише првата датотека од директориумот која е еднаква според equals методот
    - Метод за додавање на датотека во директориумот со потпис void add(const File & file) кој ќе додава датотеката во директориумот

    Не го менувајте почетниот код.
*/
