/*
    Да се дефинира класа Ekipa за коjа се чуваат следниве информации:

    - името на екипата (низа од наjмногу 15 знаци)
    - броj на порази
    - броj на победи

    За оваа класа да се дефинира метод pecati() коjа ги печати податоците за екипаta.
    
    Од оваа класа да се изведe новa класa, FudbalskaEkipa.

    За фудбалската екипа дополнително се чуваат информации за:

    - вкупниот броj на црвени картони
    - вкупниот броj жолти картони
    - броjот на нерешени натпревари

    За фудбалската екипа да се преоптовари методот pecati(), така што покрај останатите информации,
    ќе се испечатат и бројот на нерешени резултати и вкупен број на поени во формат:
        - Име на екипа,
        - броj на победи,
        - броj на порази,
        - броj на нерешени натпревари и
        - вкупен броj на поени (за победа фудбалската екипа добива 3 поени, додека за нерешен резултата, 1 поен);
*/
