/*
    Да се дефинира апстрактна класа User за која ќе се чуваат:

    - username (char[50])
    - password (char[50])
    - email (char[50])

    Класата треба да содржи еден чист виртуелен метод double popularity().

    Од оваа класа да се изведат две класи и тоа FacebookUser и TwitterUser.

    За класата FacebookUser уште се чуваат и:

    - број на пријатели
    - број на лајкови и
    - број на коментари

    Популарноста се пресметува така што се собираат бројот на пријатели, бројот на лајкови и бројот на коментари,
    но притоа бројот на лајкови се множи со коефициент на вредност на лајкот кој е ист за секој корисник и изнесува 0.1,
    а исто така и бројот на коментари се множи со ист таков коефициент кој е 0.5.

    За класата TwitterUser уште се чуваат и:

    - број на следачи и
    - број на твитови

    Популарноста се пресметува така што се собираат бројот на следачи и бројот на твитови,
    но притоа бројот на твитови се множи со коефициент на вредност на твитот кој е ист за секој корисник и изнесува 0.5.

    Да се креира класа SocialNetwork која ќе содржи:

    - динамичка низа од покажувачи од класата User
    - број на тековни корисници и
    - максимален број на корисници кој може да го содржи мрежата и кој е ист за сите мрежи и иницијално е поставен на 5

    Да се преоптовари операторот += со кој ќе се додава нов корисник.

    Да се дефинира метод avgPopularity() кој ќе ја враќа просечната популарност на корисниците во мрежата.

    Исто така да се овозможи промена на максималната големина на низата преку методот changeMaximumSize(int number).

    Потребно е да се справите со следните исклучоци:

    - Доколку лозинката на корисникот не содржи барем 1 голема буква, 1 мала буква и 1 број да се фрли исклучок
    од класа InvalidPassword така што како параметар ќе се прати пораката Password is too weak.

    - Доколку емаилот на корисникот не содржи точно еднаш @ да се фрли исклучок
    од класа InvalidEmail така што како параметар ќе се прати пораката Mail is not valid.

    - Доколку проба да се додаде корисник во социјалната мрежа, а веќе максималниот број на корисници е пополнет да се фрли исклучок
    од класа MaximumSizeLimit така што како параметар ќе се прати максималниот број на корисници во мрежата.

    Сите класи кои се справуваат со исклучоци треба да го имаат имплементирано методот void message()
    така што за првите две класи ќе ја печати пораката којашто е испратена како параметар,
    а за последната класа ќе печати You can't add more than N users, каде што N е параметарот кој е пратен.

    Исто така со try-catch блокови справете се со исклучоците на соодветните места во main(),
    каде што во catch ќе го повикате методот message() од соодветниот исклучок.
*/
