/*
    Да се дефинира апстрктна класа Number со следните чисто виртуелни методи:

    - double doubleValue() -ја враќа децималната вредност на даден број
    - int intValue()- ја враќа целобројната вредност на даден број
    - void print() - печати информации за бројот. (1 поен)

    Од оваа класа да се изведат две класи:

    - Integer (во која што се чува еден број од тип int)
    - Double (во која што се чува еден број од тип double) (1 поен).

    За двете изведени класи да се имплементираат соодветни конструктори, како и да се препокријат методите од основната класа. (1 поени)
    Да се преоптовари операторот == којшто ќе споредува два броеви според нивната вредност (објекти од класа Number) (1 поен)

    Дополнително да се дефинира класа Numbers во која што ќе се чуваат:

    - динамички алоцирана низа од покажувачи кон објекти од класата Number
    - број на елементи во низата од покажувачи

    За класата да се имплементира соодветен конструктор (default) , како и: (1 поени)
    - операторот += за додавање на броеви во низата од броеви (1 поен)
        Бројот се додава ако и само ако сите броеви што се веќе додадени во низата се различни од него
    - функција void statistics() која што печати информации за броевите во низата: (2 поени)
        - Count of numbers: [број на броеви во низата
        - Sum of all numbers: [сума на сите броеви во низата]
        - Count of integer numbers: [број на цели броеви (Integer)]
        - Sum of integer numbers: [сума на сите цели броеви (Integer)]
        - Count of double numbers: [број на децимални броеви (Double)]
        - Sum of double numbers: [сума на сите децимални броеви (Double)]
    - функција void integersLessThan (Integer n) која што ги печати сите цели броеви помали од бројот n (1 поен)
    - функција void doublesBiggerThan (Double n) која што ги печати сите децимални броеви поголеми од бројот n (1 поен)
*/
