/*
    Да се имплементира апстрактна класа Secret со два чисто виртуелни методи:

    - double simpleEntropy() - се пресеметува како бројот на уникатни (цифри/букви) поделен со бројот на вкупно знаци. (2 поени)
    - int total()- го враќа вкупниот број на цифри/букви. (1 поени)

    Од оваа класа да се имплементираат две изведени класи DigitSecret (цифри 0-9) и CharSecret (букви a-z)
    во кои се чува низа од максимум 100 цифри односно 100 мали букви од a до z (1 поени).

    Да се имплементира соодветен конструктор, како и следните оператори:

    - оператори== и != за споредување на два објекти од каков било тип (DigitSecret,CharSecret) според елементите што ги содржат (1 поени)
    - оператор << за печатење на стандарден излез во формат: (1 поени)
        [cifri/bukvi] Simple entropy: [entropy] Total: [total]

    Да се имплементираат методите:

    - void process(Secret **secrets, int n) - што прима низа од покажувачи од класата Secret и нивниот број и
    треба да го отпечати елементот со најголема вредност за simpleEntropy. (3 поени)
    - void printAll(Secret **secrets, int n) - што прима исти аргументи како претходниот и треба да ги испечати сите елементи во низата secrets. (1 поен)
*/
