/*
    Да се дефинира класа Employee во која ќе се чуваат информации за еден вработен:

    - ID на вработениот (низа од знаци)
    - име и презиме (низа од знаци)
    - плата (цел број)
    - статус (логичка променлива) — true = активен, false = неактивен

    За класата да се дефинираат:

    - default конструктор (каде што името и ID-то ќе останат празни, а платата и статусот ќе се сетираат на 0)
    - конструктор со аргументи
    - copy конструктор
    - доколку е потребно, get и set методи
    - функција void print() која печати во следниот формат:
        ID: [id] Name: [name] Salary: [salary] Status: [active/inactive]

    Потоа, да се дефинира класа Company во која ќе се чуваат следните информации:

    - име на компанијата (низа од знаци)
    - број на вработени во компанијата (цел број)
    - низа од вработени (низа од објекти од класата Employee)

    За класата да се дефинираат:

    - конструктор со аргументи
    - copy конструктор
    - доколку е потребно, get и set методи
    - функција void print() која печати во следниот формат:
        Company: [name]
        ID: [id] Name: [name] Salary: [salary] Status: [active/inactive]
        ID: [id] Name: [name] Salary: [salary] Status: [active/inactive]
        ...

    Прво името на компанијата, па секој вработен на нов ред.

    Во класата Company да се имплементира и функацијата getHighestPaidActiveEmployee() која го враќа активниот вработен со најголема плата.

    Доколку повеќе активни вработени ја имаат истата најголема плата, да се врати оној чие име е лексикографски помало (т.е. прв по азбучен ред).

    Се претпоставува дека секогаш ќе постои барем еден активен вработен во низата.

    НЕ ЈА МЕНУВАЈТЕ main() ФУНКЦИЈАТА.
*/
