/*
    Да се дефинира апстрактна класата Task во која што се чува информација за:

    - ID (низа од максимум 5 знаци)

    Дополнително апстрактната класа содржи два чисто виртуелни методи:

    - int getOrder() којшто го враќа редниот број (редот) на извршување на задачата (Task-oт).
    - void print() којшто печати информации за задачата (види тест примери) (1 поен)

    Постојат два вида на таскови (задачи):

    - TimedTask во којшто се чува информација за:
        - потребното време за извршување на задачата time (цел број)
    - PriorityTask во којшто се чува информација за:
        - степенот на приоритет priority (цел број)

    Редниот број на извршувањe на TimedTask e дефиниран со времето на извршување, додека пак на PriorityTask со степенот на приоритет. (1 поен)

    За двата типа на таскови да се имплементираат:

    - оператор за споредба == којшто ги споредува според нивниот ID и според нивното време/степен на приоритетност. (2 поени)
    - препокриени функции од класата Task (2 поени)

    Дополнително, да се имплементираат следните надворешни методи:

    - void scheduleTimedTasks (Task ** tasks, int n, int t) метод којшто ќе ги распореди сите задачи од тип TimedTask
    со време на извршување помало од t (ќе испечати информации за нив), сортирани во растечки редослед според времето на извршување.
    Методот прима три аргументи (низа од покажувачи кон Task, бројот на елементи во низата и времетот t) (2 поени)

    - void schedulePrioritryTask(Task ** tasks, int n, int p) - метод којшто ќе ги распореди сите задачи од тип
    PriorityTask со степен на приоритет помал од p (ќе испечати информации за нив), сортирани во растечки редослед според степенот на приоритетност.
    Методот прима три аргументи (низа од покажувачи кон Task, бројот на елементи во низата и степенот на приоритетност p) (2 поени)

    Напомена: Двете функции може да ги имплементирате и без сортирање, но во тој пример ќе ви излезат 80% тест примери точни.
*/
