/*
    1.2

    Да се креира структура Student во која се чуваат податоци за еден студент.
    За студентот се чуваат информации заЧ
    
    името на студентот(низа од карактери),
    број на индекс на студентот,
    број на курсеви кои ги слуша,
    низа од кодови на курсевите кои ги слуша.

    Потоа, да се креира структура Course во која се чуваат податоци за

    името на курсот (низа од карактери),
    код на курсот(цел број) и
    број на студенти кои го слушаат.

    Да се направи функција:

    int get_most_popular_course(struct course courses[], int num_courses)
    која што го враќа кодот на најпопуларниот курс.
*/
