/*
    Да се дефинира апстрактна класа Employee којашто ќе содржи име на вработениот, години и работно искуство во години (integer).
    Да се дефинираат чисти виртуелни функции plata() и bonus() (double).

    Од класата Employee да се изведе класа SalaryEmployee која покрај основните информации содржи и информација за основната плата.
    Бонусот на овие работници се пресметува како процент од основната плата, а процентот е бројот на години со работно искуство.
    На пример ако работеле 10 години, бонусот е 10 проценти од основната плата.
    Вкупната плата се пресметува како основната плата плус бонусот.

    Од класата Employee исто така да се изведе класа HourlyEmployee која покрај основните информации содржи
    информација и за вкупниот број на часови кои ги одработил работникот и платата по час.

    Вкупната плата се пресметува како бројот на часови помножен со платата по час плус бонусот,
    додека бонусот се пресметува на следниот начин: За секој час над 320-тиот се добива 50 проценти од платата по час.

    Од класата Employee на крај се изведува класата Freelancer која покрај основните информации содржи и број на проекти
    на кои работел вработениет и низа со суми кои ги добил за тие проекти (double).
    По направени 5 проекти, за секој нареден вработените добиваат бонус од 1000 денари.
    Вкупната плата на овој тип на вработени изнесува вкупната сума добиена од сите проекти плус бонусот.

    - Да се преоптовари операторот == кој ќе прима два објекти од класата Employee и ќе ги споредува според тоа дали имаат ист број на години и дали добиваат ист бонус.
    - Да се дефинира класа Company која ќе содржи информации за името на компанијата, бројот на вработени, и динамична низа од покажувачи од класата Employee или Employee **.

    За потребите на оваа класа треба:

    - да се дефинира конструктор кој прима само еден аргумент
    - името на компанијата,
    - да се преоптовари операторот +=
    - да се дефинираат следните методи:
        - double vkupnaPlata() - метод којшто ја враќа вкупната плата на сите вработени во компанијата
        - double filtriranaPlata(Employee * emp) - метод којшто ја враќа платата само на работниците кои се еднакви со дадениот вработен (според оператор ==)
        - void pecatiRabotnici() - метод којшто печати по колку вработени има од секој тип на работници во компанијата, а форматот на печатење можете да го видите од тест примерите

    Hint: За потребите на последниот метод можете да искористите статички членови и статички функции во секоја од класата,
    dynamic_cast, виртуелна функција која ќе ја преоптоварите во секоја од класите или нешто друго по ваша желба.
*/
