/*
    Да се напише класа за матрица.
    Во класата се чуваат елементите од матрицата од тип float (матрица со максимална димензија [10]x[10]) и големината на матрицата (број на редици и колони).

    За оваа класа да се преоптоварат следните оператори:

    - оператор + за собирање матрица со број
    - оператор - за одземање на матрици
    - оператор * за множење на матрици
    - операторот >> за внесување на елементите на матрицата
    - операторот << за печатење на елементите на матрицата

    Во главната функција да се креираат објекти A, B и C со подразбирливиот конструктор на класата Matrica.
    Од стандарден влез да се прочитаат нивните вредности.
    Да се отпечати вредноста на изразот A-(B*C)+2 на стандарден излез.

    Да се претпостави дека секогаш матриците ќе бидат квадратни со ист број на редици и колони.
*/
