/*
    Да се дефинира класата Kvadrat во која што се чува информација за:

    - должината на страната а на квадратот (double)

    За класата да се дефинираат:

    - default конструктор
    - конструктор со аргументи
    - copy конструктор
    - double perimetar () што пресметува периметар на квадратот
    - double plostina () што пресметува плоштина на квадратот
    - void pecati () што печати информации за квадратот како во тест примерите

    Да се имплементира класа Pravoagolnik што наследува од класата Kvadrat.
    Во неа се чуваат дополнителни информации за:

    - проширувањето x на двете паралелни страни на квадратот (double)
    - проширувањето у на другите две паралелни страни (double)

    Правоаголникот всушност сега ќе има 2 страни со должина a+x и две страни со должина a+y.

    За класата да се дефинираат:

    - default конструктор
    - конструктор Pravoagolnik (const Kvadrat &k, double x, double y)
    - copy конструктор

    Да се препокријат трите методи дефинирани погоре за класата Kvadrat.

    Напомени:

    Ако x и y се исти, тогаш формата не е правоаголник туку е повторно квадрат.
    Во тој случај pecati() се повикува исто како за квадрат.
    При препокривање на методите во класата Pravoagolnik мора да има повик кон истоимените методи од класата Kvadrat
*/