/*
    3)Да се дефинира класа Country во која ќе се чуваат информации за:

    - name(низа од максимум 100 карактери) име на државата
    - capital(низа од максимум 100 карактери) главен град
    - area(децимален број) - површина во илјада km2
    - population(децимален број) - популација во милиони.

    Сите променливи внатре во класата треба да бидат приватни. Соодветно во рамките на класата да се дефинираат:

    - конструктор (без и со параметри)
    - деструктор
    - set методи
    - get методи

    Да се дефинираат следните методи во класата:

    - display() која што ќе ги печати информациите за сметката во следниот формат:

        Country: Guyana
        Capital: Georgetown
        Area: 214
        Population: 0.8

    Надвор од класата:

    - sortCountries(Country *countries, int n) која што ќе ги сортира државите растечки по нивната површина.

    ДА НЕ СЕ МЕНУВА MAIN ФУНКЦИЈАТА.
*/