/*
    Да се дефинира класа Vozilo која ќе содржи информација за неговата маса (децимален број), ширина и висина (цели броеви).

    Од оваа класа да се изведе класата Автомобил во која како дополнителна информација се чува информацијата за бројот на врати (цел број).

    Од класата возило да се изведе и класата Автобус во која се чуваат информации и за бројот на патници кои може да ги пренесува.

    Од класата возило да се изведе класата Камион во која се чуваат информации и за максималната маса која може да се товари на него (децимална вредност).

    За сите класи да се креираат погодни контруктори, како и set и get функции.

    Да се дефинира класа ParkingPlac за која се чува динамичко алоцирано поле од покажувачи кон Vozilo, како и бројот на елементи во полето.
    Во оваа класа да се дефинираат:

    - конструктор
    - деструктор
    - операторот += за додавање на ново возило (аргументот е покажувач кон Vozilo)
    - функција float presmetajVkupnaMasa() со која се пресметува вкупната маса на сите возила во паркинг плацот
    - функција int brojVozilaPoshirokiOd(int l) со која се пресметува бројот на возила кои се пошироки од дадената вредност
    - функција void pecati() со која се печати: Brojot na avtomobili e X, brojot na avtobusi e Y i brojot na kamioni e Z.
    - функција int pogolemaNosivostOd(Vozilo& v) во која се враќа бројот на сите камиони кои имаат носивост поголема од масата на возилото предадено како аргумент.

    Да се дефинира виртуелна функција int vratiDnevnaCena() во класата Vozilo и истата да се преоптовари во сите изведени класи.

    - За секој автомобил со помалку од 5 врати дневната цена е 100, а инаку е 130 денари.
    - За секој камион цената се пресметува со формулата: (masa+nosivost)*0.02.
    - За секој автобус цената е 5 денари по лице кое може да се пренесува.

    Во класата ParkingPlac да се додаде следната функција:

    - функција int vratiDnevnaZarabotka() со која се враќа дневната заработка од сите возила на паркингот.
*/
