/*
    Во оваа задача треба да се внесат и испечатат податоци за автомобили.
    За еден автомобил (објект од класата Car) се чуваат следниве податоци:

    - сопственик (објект од класата Person)
    - датум на купување (објект од класата Date)
    - цена (float price), предодредена вредност 0
    - За класата Car потребно е да се напише метод за печатење print() и метод за добивање на цената getPrice().

    Класата Date содржи три цели броеви (int year, month, day) кои претставуваат датум.
    За неа треба да се напише:

    - метод за печатење print()
    - предодреден (default) конструктор
    - конструктор со параметри
    - конструктор за копирање.

    Класата Person содржи име и презиме (низи од максимум 20 знаци, со предодредени вредности not specified),
    предодреден конструктор, конструктор со параметри и метод за печатење print().

    - Методот за печатење кај класата Person изгледа вака: [name] [lastName].
    - Методот за печатење кај класата Date изгледа вака: [year].[month].[day].
    - Методот за печатење кај класата Car изгледа вака:

        - owner.print()
        - date.print()
        - Price: [price]

    Покрај тоа, потребно е да се напише метод cheaperThan(Car* cars, int numCars, float price) кој ќе ги испечати
    сите објекти Car од низата cars со големина numCars чија цена е помала од price.
*/
