/*
    Со default конструкторот, почетните вредности на атрибутите да бидат:

    - низа од знаци до 50      name = "title- name"
    - низа од знаци до  50     author = "author"
    - низа  од  20                        isbn = "9730-000-000-0000-0"
    - цел број                             readers = 0

    За класата да се имплементираат соодветните конструктори.

    Да се преоптовари операторот << за печатење на објект од класата Book.

    Во класата да се имплементира и bool функција за проверка на ISBN бројот, при што:

    - првите 4 цифри од ISBN секогаш мора да бидат 9473
    - ISBN бројот мора да содржи точно 4 знаци :  " - "
    - вкупниот број на цифри во ISBN не смее да биде поголем од 13

    Да се допише main функција за тестирање на класата.
*/